Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
/******************************************************************************/
/*                                            COPYRIGHT (c) NXP 2017          */
/* FILE NAME kw35a.c                                         		          */
/* VERSION:  1.x                                   All Rights Reserved     	  */
/*                                                                        	  */
/* DESCRIPTION:                                                               */
/*                                                                            */
/*													                          */
/* PART INITIALIZATION SEQUENCE								                  */
/*                                                                            */
/* Omissions:                                                                 */
/*                                                                            */
/*============================================================================*/ 
/* AUTHOR: DOUG GROVER                                                   	  */
/* COMPILER: Code Warrior        VERSION: MPC55x                           	  */
/*                                                                        	  */
/*============================================================================*/ 
/* UPDATE HISTORY - KW35A                                                     */
/*                                                                            */
/* 1.00 M.LaCroix 20Mar2017                                                   */
/*	Generated from KW40_512 burn-in procedure. Reference KW35A includes.      */
/******************************************************************************/
/******************************************************************************/
 
/**************************************************/
/*               INCLUDE FILES                    */
/**************************************************/ 
#include "cc3.h"
#include "functions.h"

#include "s19data.h"
#include "revision.h"

#include "kw35a.h"

#include "jtag.h"

#include "uart.h"
#include "string.h"
#include "stdio.h"

/******************************************************************************/
/*                    Global and External Variables                           */
/******************************************************************************/

static UINT8 *badDut;

//UINT8 ModLoopCount[MAX_DUTS+3];	/*track number of cycles executed before qcheck failed, belongs in qcheck.c*/

UINT8 DutNumbers[] = SOCKET_LIST; 	/* defines which DUT return lines are used on the BIB */
UINT8 SCANNumbers[] = SCAN_LIST; 	/* defines which DUT return lines are used on the BIB */

UINT16 qfail =0;

/* set up the RCS text using format "$filename$rev$author" - IBE reads from s-record */
const UINT8  RCS[] = RCS_TEXT;

int power(int value,int power);
int strToHex(char *convert);

static VUINT16 *pStartButton;				/* indicates when START button is pressed for BI flow control 

/*******************************************************************************
FUNCTION        : main
PURPOSE         : Main function
INPUTS NOTES    : void
RETURNS NOTES   : void
GENERAL NOTES   : 
*******************************************************************************/
void main (void)
{	
//	static VUINT16 *pStartButton;			/* indicates when START button is pressed for BI flow control */

/******************************************************************************/
/* DECLARE VARIABLES HERE                                                     */	
/******************************************************************************/

//	UINT16 status;
	UINT32 i = RCS[1]; 		/* not used by executable code, but includes RCS header string in s19 */

// Define arrays to capture mode and data from each execution component during each loop.
// Define within main() so arrays reside in stack. No conflict when providing TK EDT stimulus using HSVG.

	UINT32 MISCData0[SOCKET_COUNT];			/* Use to capture JTAG ID / RAM BIST loop count / SCAN output word */
	UINT32 MISCData5[SOCKET_COUNT];			/* Use to capture mode by logging JTAG Test Register for each component */

/******************************************************************************/
/* INITIALIZE THE DRIVER HERE                                                 */
/******************************************************************************/
	SetupBI ();								/* This must be the first function called from the BI code */
	badDut = GetBadDutAddress ();			/* Get the address of global badDut */
	pStartButton = GetStartButtonAddress ();

	SetDutDisplay (DUT_TYPE, DUT_SW_REV);	/* set up DUT specific text for start button */
 
	DisplayScroll (FAST, SCROLL_NAME);		/* Display the device type */

	StartButton = BURN_IN;  				/* for stand alone mode, display the device type and await start button */
                 
	if (MODEID != MODE_IBE)                  
	{                                        
		while (StartButton != QCHECK);     	/* Wait here until "START" button is pushed */
	}                                        
	StartButton = QCHECK;	  				/* force qcheck to run first time */

	VdutsPowerDownOrder(4,3,2,1,5,100000);	/* orderly shut-down on driver supply event w/100ms delay */
	
/**********************************************************************************/
/* Initialize the o/p pins */
/**********************************************************************************/

// Perform this in VddRamp(); specify CC3/CC3E to determine control syntax
//	SET_VIO_VDUT1;							/* VIO  follows VDUT1 (or VDUT4) */
//	SET_VCLK_VDUT1;							/* VCLK follows VDUT1 (or VDUT2) */
// Initialize resources, not used until after VddRamp() selects actual operating conditions

	OUT0_31 = (0x00000000);					/* CLEAR ALL OP prior to initial power up */

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1((UINT16)1500,DUTCODE);	/* init resources, not used until after VddRamp() */
		SetPsBuf2((UINT16)1500,DUTCODE);	/* init resources, not used until after VddRamp() */
		SetPsBuf3((UINT16)1500,DUTCODE);	/* init resources, not used until after VddRamp() */
	}
	else if(DRIVER_TYPE == CC3)
	{

#ifdef DCDC_BUCK							/* VDUT1 supplies DCDC voltage */

		SetVdut(4,4000);					/*	VIO/SCK tracks with VDUT4 */
		WaitSeconds(1);
	
 		AnOut(10000); 						/* Set Anout to > 10V to power up eFuse circuit */

		SET_VIO_VDUT4;						/* VIO  follows VDUT1 (or VDUT4) */
		SET_VCLK_VDUT2;						/* VCLK follows VDUT1 (or VDUT2) */		

