Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
		WaitSeconds(1);		
#endif

#ifdef DCDC_BYPASS

		SetVdut(4,4000);					/*	VIO/SCK tracks with VDUT4 ... ONLY for ARMING eFUSE  */
		WaitSeconds(1);
	
 		AnOut(10000); 						/* Set Anout to > 10V to power up eFuse circuit */
		SET_VIO_VDUT4;						/* VIO  follows VDUT1 (or VDUT4) */
		SET_VCLK_VDUT2;						/* VCLK follows VDUT1 (or VDUT2) */
#endif

	}

// note: after trip idd test, driver level source is set for Buck vs Bypass in the VddRamp function

	OE1_DISABLE;  							/* DIS = DUT81-88, EN = OP8-15 */

	OE2_ENABLE;  							/* DIS = DUT89-92, EN = OP16-19 */
	OE3_ENABLE;  							/* DIS = DUT93-96, EN = OP20-23 */

	SEL_DISABLE;							/* EN= PCS0-3, DIS = OP0-3 */

	DDR_DRIVER_OUTPUT;						/* IN = DUT97-104, OUT = IO24-31 */

//	TempRx(3, UPDATE_DATA);					/* Sample the temperature IC */
//	WaitSeconds(2);
//	status = TempRx(3, GET_DATA);			/* Collect the previously sampled temperature */

/**********************************************************************************/
/* Initialize Part */
/**********************************************************************************/

/* DUT_CLK1 at default Fbus - other clocks follow DUT_CLK1 */
/* NOTE: SetClock() function will enable clocks (defeats SetClockOptions() OE_OFF_LOW ) */

	SetClocksInit();

/* After initial setup, terminate inputs low until needed in run functions */

	SetClocksOff(); 						/* clock inputs held low for initialization */		
	
/**********************************************************************************/
/* Initialize VDUT - avoid ECB trip due to current surge at power up, relax limit */
/**********************************************************************************/

	if(DRIVER_TYPE == CC3E)
	{
		SetVdut(5,9000);						/* Set VDUT5 to > 10V to power up eFuse circuit */
		SetEcb5Limit(3000);						/* some reliability ovens set Vin1 to 10V - cannot exceed */
		WaitSeconds(1);
	}
	else if(DRIVER_TYPE == CC3)
	{
 		AnOut(9000);                          	/* Set Anout to > 10V to power up eFuse circuit */
		WaitSeconds(1);							/* some reliability ovens set Vin1 to 10V - cannot exceed */
	}

	eFuse_Ctrl_INIT;							/* QSMCM.DDRQS.B.QDDSCK configured as output */
	eFuse_Ctrl_DISABLE; 						/* SCKAB = 1 to disable/reset eFuse circuit */
	WaitSeconds(1);								/* Delay while signals stabilize */ 
	eFuse_Ctrl_ENABLE;							/* SCKAB = 0 to enable over-current monitoring on eFuse  */
	WaitSeconds(1);								/* Delay while signals stabilize */ 

/* avoid false trip at inital power up by cranking current limit wide open */

//	SetEcbLimit (10000, 4000, 4000, 4000);
//
//	voltage[0]=ECB_REARM1;
//	voltage[1]=ECB_REARM2;
//	voltage[2]=ECB_REARM3;
//	voltage[3]=ECB_REARM4;
//	
//	status = SetVdutsAll(voltage[0],voltage[1],voltage[2],voltage[3]);	
//	WaitSeconds(1);
//
//	voltage[0]=ECB_VLTG1;
//	voltage[1]=ECB_VLTG2;
//	voltage[2]=ECB_VLTG3;
//	voltage[3]=ECB_VLTG4;
//	
//	status = SetVdutsAll(voltage[0],voltage[1],voltage[2],voltage[3]);	
//	WaitSeconds(1);

/* read/display current draw on board (display is in mA) */

//	DisplayScroll (FAST, "VDUT1(mA)    ");
//	DisplayDec (GetCurrent(1)*100);
//	WaitSeconds(1);
//
//	DisplayScroll (FAST, "VDUT2(mA)    ");
//	DisplayDec (GetCurrent(2)*100);
//	WaitSeconds(1);

/* confirm absence of high current conditions using actual ECB circuit */

//	SetEcbLimit (ECB1_IPOR,ECB2_IPOR,ECB3_IPOR,ECB4_IPOR);
//	WaitSeconds(1); 						/* time allowed to read */

// VDUT2/3/4 should always be disabled. VddRamp() function enables, controlled by header voltage[].

//	voltage[1]=0;							/* initial ramp from POR always disables supply */
//	Vdut2Off();					
//
//	voltage[2]=0;							/* initial ramp from POR always disables supply */
//	Vdut3Off();					
//
//	voltage[3]=0;							/* initial ramp from POR always disables supply */
//	Vdut4Off();					

// set ECB to allow surge during VDUT switching, run mode changes, could maybe be lower. Q-Check will reduce for partially populated BIBs
	SetEcbLimit (ECB1_RUN,ECB2_RUN,ECB3_RUN,ECB4_RUN);

/********************************************************************************************/
/* All downloads including polls are performed in BKGD Test Mode - enter w/ Q-Check levels  */
/********************************************************************************************/

/********************************************************************************************/
/* Do Qcheck first through after a Driver reset.  Make results available to IBE and display */
/********************************************************************************************/
	StartButton =QCHECK;
/***************************************************************************************/
/* BEGIN THE BURN-IN CODE */
/***************************************************************************************/
/* IBE BURN-IN LOOP */
	while(1)
	{
		switch (StartButton)									/* Either perform QCHECK, BURN-IN, OR BIN2_CHECK */
		{
			case QCHECK :			
			{
				WaitSeconds (1);
				if (StartButton != QCHECK)
					break;										/* required in case button pressed twice quickly for BIN2 check since loop is fast */
								
				DisplayChar("QCHK");

				SWD_Qcheck();									/* enable eFuse after power-up, poll for populated sockets */

				PreviousButton = QCHECK;						/* set after polling - used in Bin2 flow control */

				while(StartButton == QCHECK)
				{	
				DisplayBadDutsOnce();    
				}

				break;
			}

			case BURN_IN :										/* BI CODE */
			{
				DisplayScroll (FAST, "Log ECID");				/* Update display as we begin stresses */

// Capture JTAGID Register
				DisableDutData(0);								/* insures array available to post data to log file */
				SWDReadReg(DPACC,JTAGID,MISCData0);
				EnableDutData(0,(UINT32)MISCData0,DatarrySize);

// Capture ECID

// On KW35A, there is no SIM_UIDH Register . . . 
//				DisableDutData(1);								/* prevent host from polling prior to data initialization */
//				SWDInterimRead(MISCData1,1,DatarrySize,ECIDLoc1);

				DisableDutData(2);
				SWDInterimRead(MISCData2,2,DatarrySize,ECIDLoc2);
				DisableDutData(3);
				SWDInterimRead(MISCData3,3,DatarrySize,ECIDLoc3); 
				DisableDutData(4);
				SWDInterimRead(MISCData4,4,DatarrySize,ECIDLoc4);

