Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
// Read Time Zero NVM Status - log if interested (enable in data collection - only place DutData 6-9 are captured)

#ifdef TARGET_NVM
				DisableDutData(6);
				SWDInterimRead(MISCData6,6,DatarrySize,StatusAddr1);
				DisableDutData(7);
				SWDInterimRead(MISCData7,7,DatarrySize,StatusAddr2);
				DisableDutData(8);
				SWDInterimRead(MISCData8,8,DatarrySize,StatusAddr3); 
				DisableDutData(9);
				SWDInterimRead(MISCData9,9,DatarrySize,StatusAddr4);

				WaitSeconds(90);						/* Delay while logging data */ 
#endif

				DisplayScroll (FAST, "Start -BI-");				/* Update display as we begin stresses */

				SetStartTime();									/* Records beginning of burn-in (in seconds) */
				SWDRunModules(MISCData0, MISCData5);          	/* all components share arrays stored in stack */
				PreviousButton = BURN_IN;						/* set after run modules - used in Bin2 flow control */
		
				VddRamp(HSVGData[BIN2_PTR].downloadVoltage); 	/* ready for operator to request polling operation */

				SWD_AHB_CFG(BIN2_CHECK,0);		/* setup for polling */

				while(StartButton == BURN_IN)
				{	
				DisplayScroll (FAST, "Stress Complete ... Waiting for Bin2   "); /* Display while waiting for operator */
				}
				break;	            			/* exit case, proceed with Bin2 check next */ 

			} /* end case BURN_IN */

			case BIN2_CHECK :
			{
				DisplayScroll (FAST, "Run BIN2"); /* Display upon entry */

				SWDBin2();						/* put the Bin2 table 2nd in the structure */			

				PreviousButton = BIN2_CHECK;	/* set after polling - used in Bin2 flow control */

				ShutDown();						/* orderly shut-down of all DUT supplies and inputs */

				StartButton = BURNIN_DONE;  	/* added to allow operator to use 'RUN BIN2' GUI */
 				while(StartButton == BURNIN_DONE)
				{	
					DisplayScroll (FAST, "Bin2 Test Complete ... Burn-In DONE"); /* Display upon exit */
					WaitSeconds(1);				
				}
				break;							/* Leave bin2 check */
			}
		}	/* end of switch */
		
	}	/* end of while */

}	/* end of MAIN */

/* =============================================================================== */

void ShutDown(void)								/* power off all resources in an orderly fashion */
{
	RESET_LOW; 									/* Rst = low */

	OUT0_31 = 0x00000000;						/* all driver outputs terminated low */
	SetClocksOff();								/* clocks driven low before removing power */

	voltage[0]=POR_REARM1;						/* values are tested in VddRamp function, allows restart, repeated poll */
	voltage[1]=POR_REARM2;
	voltage[2]=POR_REARM3;
	voltage[3]=POR_REARM4;

	SetVdutsAll((UINT16)voltage[0],(UINT16)voltage[1],(UINT16)voltage[2],(UINT16)voltage[3]);	
	WaitSeconds(2);								/* drives to voltage that will de-assert POR */
	VdutsOff();									/* power supplies off */
}

/* =============================================================================== */
/* =============================================================================== */

/*******************************************************************************
FUNCTION        : SWD_QcheckDut
PURPOSE         : performs a generic socket check by accessing target memory and checking contents.
INPUTS NOTES    : Enhanced to check that DUT is unsecured. Fail is security or protection enabled.
			sockets - pointer to array where a list of the dut return lines
			that are used.  sockets[0] = total number of sockets and the rest
			contain the return lines.
RETURNS NOTES   : void
GENERAL NOTES   : QCHKResult will be used to filter ghost sockets (NRDs) on interim data reads
                  
*******************************************************************************/

void SWD_Qcheck(void)
{
	UINT8  countFail, i;

	UINT32 PartialECB1 = 0;							/* ECB limits are reduced for partially populated BIBs */
	UINT32 PartialECB2 = 0;

 	for (i = 0; i < SOCKET_COUNT; i++)				/* Initialize dataDut to all zeros */
		QCHKResult[i] = 0;	

// Set up for polling

	QSMCM.PQSPAR.B.QPAMISO=0;						/* Use MISO as general purpose input from DUT_MUX */
	ResetBadDut ();									/* clear BadDut array to 0 */

	VddRamp(HSVGData[QCHECK_PTR].downloadVoltage); 	/* note: starting from POR_VLTG1 will ramp up only */

	DisplayChar("QCHK");

// eFuse arming sequence is performed one time only during procedure, immediately prior to Q-Check

//	eFuse_Ctrl_DISABLE; 							/* SCKAB = 1 to disable/reset eFuse circuit */
//	WaitSeconds(1);									/* Delay while signals stabilize */ 
//	eFuse_Ctrl_ENABLE;								/* SCKAB = 0 to enable over-current monitoring on eFuse  */
//	WaitSeconds(1);									/* Delay while signals stabilize */ 

// Q-Check will read protection/security word at 0x0000040C, should read 0xFFFFFFFE
	SWD_AHB_CFG(QCHECK,0);							/* set up for polling */
	
// Now set the AHB_TAR to the address of the 1st word in status, read using AHB_DRW
	SWDWriteReg(APACC,AHB_TAR,SecurityLoc);			/* Set target location in TAR for APACC memory access */

#ifdef DEBUG
	SWDReadReg(APACC,AHB_TAR, QCHKResult);			/* first read posts data to shift chain */
	SWDReadReg(APACC,AHB_TAR, QCHKResult);			/* second read shifts data out for capture */
#endif

// Actual AHB_DRW data is shifted out on command following read request - read again to capture true results
	SWDReadReg(APACC,AHB_DRW, QCHKResult);			/* first read posts data to shift chain */
	SWDReadReg(APACC,AHB_DRW, QCHKResult);			/* second read shifts data out for capture */
													/* WRITE THE FAILING SOCKETS TO GLOBAL VARIABLE badDut */
	for (i=0,countFail=0; i<DutNumbers[0]; i++)		/* identifies the failing sockets for baddut array */
	{
		if ((QCHKResult[i] !=  SecurityVal))		/* Protection and security should be disabled */
		{
			badDut[countFail+Q_DUT_OFFSET] = (i+1);	/* adds bad socket to list of bad sockets */
			countFail++;							/* increments bad socket count */
		}
	}

	badDut[Q_FAIL_COUNT] = countFail;				/* Write total dut failures to array */
	badDut[Q_STATUS] = QCHECK_READY; 				/* table completed */

// Adjust ECB limits based on number of populated sockets. Fraction of current limit coincides with fraction of populated sockets
	PartialECB1 = (ECB1_RUN * (DutNumbers[0]-countFail) / DutNumbers[0]) + 400; 
	PartialECB2 = (ECB2_RUN * (DutNumbers[0]-countFail) / DutNumbers[0]) + 400; 

	SetEcbLimit ((UINT16)PartialECB1, (UINT16)PartialECB2, (UINT16)ECB3_RUN, (UINT16)ECB4_RUN);

}													/* end SWD_Qcheck() */

