Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
/**********************************************************************************/
/**********************************************************************************/

/***************************************************************************************/
// use QChkResult[] to filter reads, eliminate ghosting from unpopulated sockets
// defined as global UINT32 QCHKResult[SOCKET_COUNT]; /* used to filter ghosts during DUT data reads */
/***************************************************************************************/

void SWDBin2(void)
{
	UINT32 StatusWord[SOCKET_COUNT];			/* for DP_ACC/AP_ACC, shift read results into array */
	UINT32 dataDut[SOCKET_COUNT];

	UINT8 i,DUTStatus;

//	QSMCM.PQSPAR.B.QPAMISO=0;					/* Use MISO as general purpose input from DUT_MUX */
	ResetBadDut();								/* clear badDut array to 0 */

 	for (i = 0; i < SOCKET_COUNT; i++)				/* Initialize dataDut to all zeros */
		dataDut[i] = 0;	

	DisplayChar("BIN2");


// Since you don't really know when or where you are calling from, may need to exit SCAN/BIST mode
//	if (PreviousButton == BIN2_CHECK)		 	/* if repeating Bin2, need to restore power and initialize JTAG */
//	{
		VddRamp(HSVGData[BIN2_PTR].downloadVoltage); 	/* */
//	}

//	RESET_LOW;									/* included in function SWD_AHB_CFG() */
//	WaitMicroSeconds(100000);					/* Delay 100mS */
	
	SWD_AHB_CFG(BIN2_CHECK,0);							/* setup for polling */
	
// Select the AHB-AP to access RAM data transfer registers (debug access port 0, bank 0)

	SWDWriteReg(DPACC,DP_SELECT,AHBAP_SEL);			/* Select the AHB-AP for memory access */

// Set the AHB_TAR to the address of the 1st word in status, read using AHB_DRW

#ifdef TARGET_NVM
	SWDWriteReg(APACC,AHB_TAR,StatusAddr1);		/* Selects AHB-AP TAR for APACC access */			
#endif
#ifdef TARGET_HTOL
	SWDWriteReg(APACC,AHB_TAR,SecurityLoc);		/* Selects AHB-AP TAR for APACC access */		
#endif

	SWDReadReg(APACC, AHB_DRW, StatusWord);		/* first read posts data to shift chain */
	SWDReadReg(APACC, AHB_DRW, StatusWord);		/* second read shifts data out for capture */

// Extract status and pass into badDut array 

	for (i = 0; i < DutNumbers[0]; i++)			
	{

#ifdef TARGET_NVM
			DUTStatus = StatusWord[i] >> 24;	/* shift returned status value so status is lower byte */
#	ifdef CLEAR_NVM_SECURITY
 			badDut[Q_DUT_OFFSET+i] = (QCHKResult[i] != Populated) ? BIN2_NRD : (StatusWord[i] == NVM_Passcode) ? BIN2_PASS : BIN3_FAIL;
#	else
 			badDut[Q_DUT_OFFSET+i] = (QCHKResult[i] != Populated) ? BIN2_NRD : (StatusWord[i] == NVM_Passcode) ? BIN2_PASS : ((DUTStatus == 0xFF) || (DUTStatus == 0x10)) ? BIN2_FAIL : BIN3_FAIL;
#	endif
#endif

#ifdef TARGET_HTOL
			DUTStatus = StatusWord[i] << 24;	/* not used for HTOL, included here to avoid compile warning when TARGET_HTOL defined */
			badDut[Q_DUT_OFFSET+i] = (QCHKResult[i] != Populated) ? BIN2_NRD : (StatusWord[i] == HTOL_Passcode) ? BIN2_PASS : BIN3_FAIL;
#endif
	}

	badDut[Q_FAIL_COUNT] = DutNumbers[0]; 		/* numSockets - Bin2 needs to know number of sockets */
	badDut[Q_STATUS] 	 = QCHECK_FINAL; 		/* Bin2 complete, ready for IBE to get data */


// On NVM cycling resubmission, avoid excessive execution of redundant downloads by checking DUT status. Final Bin2 from GUI when all BIBs done.
// Broken out for ease of introduction / removal. Supports Flex (10K + 10K) as well as non-Flex cycling procedures.

#ifdef TARGET_NVM

	if (FirstPassFlag)
	{
		RAMLOAD_ENABLED = RAMLOAD_COMPLETE;					/* if no DUTs identified as Bin2, cycling will be complete */

		for (i = 0; i < DutNumbers[0]; i++)			
		{
			if (badDut[Q_DUT_OFFSET+i] != BIN2_NRD)			/* only look at DUTs not previously identified as NRD */
			{
				if (badDut[Q_DUT_OFFSET+i] == BIN2_FAIL)
					RAMLOAD_ENABLED = RAMLOAD_CONTINUE;		/* if any DUT identified as Bin2/NRD, cycling is NOT complete */			
			}
		}		
	}
	else
	{
		FirstPassFlag = FLAG_SET;
		
		for (i = 0; i < DutNumbers[0]; i++)			
		{
			if (badDut[Q_DUT_OFFSET+i] != BIN2_NRD)			/* only look at DUTs not previously identified as NRD */
			{
				if (badDut[Q_DUT_OFFSET+i] == BIN2_FAIL)
					FirstPassFlag = FLAG_CLR;				/* if any DUT identified as Bin2/NRD, cycling is NOT complete */			
			}
		}		
	}

#endif

}

/***************************************************************************************/
/*   RunModules -  Runs through a list of modules.                                     */
/***************************************************************************************/

void SWDRunModules(UINT32 *Datarry0, UINT32 *Datarry5)
{
	UINT32 EnterTime, DisplayTime, TimeToRun;
	UINT16 status;
	int k, project_loop, ModuleLoop;

	/* Number of times to run through the entire module list*/
	for(project_loop=0;project_loop<LOOPPROJECT;project_loop++)
	{

		BREAK_FLAG = TRUE;									/* will indicate loop is exited with polling request */

/***************************************************************************************/
#ifdef TARGET_HTOL

		if(StartButton != BIN2_CHECK)
		{
		if((HSVGData[BIST_PTR].NumberOfRuns) != 0)			/* If flag set, interpret as desire to run */
			SWD_RAMBIST(&HSVGData[BIST_PTR],Datarry0,Datarry5);	
		}
		else break;											/* allow flow to exit project_loop */
	
		if(StartButton != BIN2_CHECK)
		{
	if((HSVGData[SCAN_PTR].NumberOfRuns) != 0)				/* If flag set, interpret as desire to run */
			SWD_BI_SCAN(&HSVGData[SCAN_PTR],Datarry0,Datarry5);
		}
		else break;											/* allow flow to exit project_loop */		

#endif

/***************************************************************************************/

		if(StartButton != BIN2_CHECK)						/* allow flow to exit project_loop */
		{
		 for(k=FUNC_PTR;k<NUMMODULE;k++)					/* Run Through All Functional Download/Execute */
		 {
		  if(StartButton != BIN2_CHECK)						/* allow flow to exit k loop */
		  {
		   for(ModuleLoop=0;(ModuleLoop<data[k].NumberOfRuns)&&(RAMLOAD_ENABLED);ModuleLoop++)
			{	
				EnterTime = ReadSeconds();					/* deduct ramp, RAM Load and message scroll from execution time */

				DisableDutData(5);							/* avoid mode capture during array manipulation. host syns DutData0 */

				VddRamp(data[k].downloadVoltage);			/* ramp down to POR, then up; clocks, all I/P low */

				SetClocksInit();							/* Set up EXTAL / XTAL / EXTAL32  default configurations */
				SetClock(DUT_CLK1,PLL1,data[k].Clock1Frequency,0);	/* EXTAL bank1 */
				SetClock(DUT_CLK2,CK1FB,0,0);						/* EXTAL bank2 */
				SetClocksOn();								/* sets up normal operating config - some off, some inverted */
				XTAL_LOW;									/* hold low ... ipp_ind_test_sync_dividers if in test mode */
		
		
		
// Any memory access into FLASH/RAM from JTAG should be performed while core is regulated.

				DisplayChar("-DL-");
				SWDDownloadS19(&data[k]);					/* exit reset w/ core hold, transfer data for download to RAM */
				SWDPatchReset();							/* access M0+:VTOR to re-map reset vector */
					
				if(data[k].downloadDelay!=0)
				 WaitSeconds(data[k].downloadDelay);
			
