Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
	voltage[0]=data[k].runVoltage[0];
	voltage[1]=data[k].runVoltage[1];
	voltage[2]=data[k].runVoltage[2];
	voltage[3]=data[k].runVoltage[3];

	status = SetVdutsAll((UINT16)voltage[0],(UINT16)voltage[1],(UINT16)voltage[2],(UINT16)voltage[3]);	
	if ((status != PASS)&&(status != VDUT_WARNING))
	{
		VdutsOff ();	
		DisplayToggle ("VDT1", "Fail");
	}

	WaitMicroSeconds(100000);						/* Delay 100mS */

#ifdef DCDC_BUCK

// Buck uses VDUT1 for DCDC_in, VDUT2 for VIO/VIOZ terminations, VDUT4 for GPIO.
// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf2((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf3((UINT16)voltage[3],DUTCODE);		/* Clocks tracks with VDUT4 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT4;						/*  VIO follows VDUT4 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT2;						/* VCLK follows VDUT2 - if powered-off, redeclare to restore voltage */
	}

#else
 #ifdef DCDC_BYPASS

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf2(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf3(voltage[0],DUTCODE);		/* Clocks tracks with VDUT1 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT1;						/*  VIO follows VDUT1 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT1;						/* VCLK follows VDUT1 - if powered-off, redeclare to restore voltage */
	}

 #else
  #error "Select only one DCDC Converter Mode DCDC_BUCK or DCDC_BYPASS in procedure parameter s19data.h file"
 #endif
#endif

// Select APACC MDM-AP for register capture for logging

				SWDWriteReg(DPACC,DP_SELECT,MDMAP_SEL);	/* Selects MDM-AP for APACC access (Access Port 1) */

// TestModeFlag determines/selects Regulator Bypass. Always be in Functional Test Mode (set in SWDDownloadS19)

				if(data[k].TestModeFlag == 1)				/* If flag set, select engage voltage override */
				{
					SWDWriteReg(APACC,MDM_TR,FuncTestDAC);	/* power up DAC */
					WaitMicroSeconds(50000);				/* Delay 50mS after completing operation */
					SWDWriteReg(APACC,MDM_TR,FuncTestPMC);	/* engage DAC for core voltage override */
					WaitMicroSeconds(50000);				/* Delay 50mS after completing operation */
				}

// If log has not captured ECID in first loop interation, do not overwrite with MDM-AP Status Register

// 				if(GetDutDataLength((UINT32)Datarry0) == 0)	/* if previous data has been logged, otherwise do not overwrite */
//				{
//					SWDReadReg(APACC, MDM_SR,Datarry0);		/* two reads required for APACC bank registers */
//					SWDReadReg(APACC, MDM_SR,Datarry0);		/* need to read once to post, once for capture */
//					EnableDutData(0,(UINT32)Datarry0,DatarrySize);
//				}

// Capture contents of MDM-AP Test Register to confirm operating conditions (mode / DAC)
 				SWDReadReg(APACC, MDM_TR,Datarry5);		/* engage DAC for core voltage override */
 				SWDReadReg(APACC, MDM_TR,Datarry5);		/* engage DAC for core voltage override */
// Log Test Register contents for all DUTs
				EnableDutData(5,(UINT32)Datarry5,DatarrySize);

// EXECUTE CODE DOWNLOADED TO RAM

				SWDGo();									/* release core hold, select AHB-AP for memory reads */

				DisplayScroll(FAST,data[k].s19FileName);	
//				sprintf(dispArray,"ok%2d",k);			/* display 'ok' in left 2 digits */
//				DisplayChar(dispArray);					/* Display running Module #*/
				DisplayChar("RL&E");						/* RAM Load and Execute */

// 				if(GetDutDataLength((UINT32)Datarry0) == 0)	/* if previous data has been logged, otherwise do not overwrite */
//				{
//	 				Capture MCG Status Register (MCG_S)
//					Confirm correct clock configuration following execution start-up
// 					Select 8-bit register access, no auto-increment to enable register write
//					SWDWriteReg(APACC,AHB_CSW,0x23000000);			/* Selects AHB-AP CSW for APACC access, DO NOT DISTURB PROT BITS */
//
// 					Specify Target Address Register for MCG Status, capture and log
//					SWDWriteReg(APACC,AHB_TAR,MCG_S);			/* Selects AHB-AP TAR for APACC access - Low Voltage Detect Status And Control 1 register */
//					SWDReadReg(APACC, AHB_DRW,Datarry0);		/* two reads required for APACC bank registers */
 //					SWDReadReg(APACC, AHB_DRW,Datarry0);		/* need to read once to post, once for capture */
//					EnableDutData(0,(UINT32)Datarry0,DatarrySize);
//
// 					Set up data transfer - AddrInc[5:4]=01 for autoincrement, Size[2:0]=010 for 32-bit writes
//					SWDWriteReg(APACC,AHB_CSW,0x23000012);			/* Selects AHB-AP CSW for APACC access, DO NOT DISTURB PROT BITS */
//				}



				DisplayTime = (ReadSeconds()) - EnterTime; /* adjust execution time to avoid drift in duration */
//				WaitSeconds(data[k].seconds - DisplayTime);

				TimeToRun = data[k].seconds - DisplayTime;
				PolledDelay(TimeToRun);

//				WaitSeconds(data[k].seconds - DisplayTime);

/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */
/* Begin Polling Insertion - read status after each module download for characterization           */
//				DisplayScroll(FAST,"Updating Log Results    ");	
				DisplayChar("LOGS");						/* avoid drift in execution for unaccounted time */

#ifdef TARGET_HTOL
// To read data out of RAM, we cannot perform POR. Issues seen accessing memory with DAC override.
// To facilitate reads through ARM debug port, reset, clear PMC bit in Test Reg, DAC control, assert core hold.

				SWD_AHB_CFG(BURN_IN,data[k].TestModeFlag);				/* setup reads with regulated core */

				SWDInterimRead(Datarry0, 0,DatarrySize,SecurityLoc);	/* reads broken out of polling procedure for persistent data */
				SWDInterimRead(MISCData1,1,DatarrySize,TempSenseLoc);	/* reads broken out of polling procedure for persistent data */
				SWDInterimRead(MISCData2,2,DatarrySize,BandgapLoc); 	/* reads broken out of polling procedure for persistent data */
				SWDInterimRead(MISCData3,3,DatarrySize,NVMChkSumLoc);
				SWDInterimRead(MISCData4,4,DatarrySize,NVMStatusLoc);

//				SWDBin2();												/* update GUI,set up JTAG for InterimRead call */
#endif

