Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
#ifdef TARGET_NVM

				SWD_AHB_CFG(BURN_IN,data[k].TestModeFlag);				/* setup reads with regulated core */

				SWDInterimRead(MISCData1,1,DatarrySize,StatusAddr1); 	/* reads broken out of polling procedure for persistent data */
				SWDInterimRead(MISCData2,2,DatarrySize,StatusAddr2); 	/* reads broken out of polling procedure for persistent data */
				SWDInterimRead(MISCData3,3,DatarrySize,StatusAddr3); 	/* reads broken out of polling procedure for persistent data */
				SWDInterimRead(MISCData4,4,DatarrySize,StatusAddr4); 	/* reads broken out of polling procedure for persistent data */
//				SWDBin2();												/* update GUI, set up JTAG for InterimRead call */
#endif

				BREAK_FLAG = FALSE;										/* tells SWDBin2() loop is not exited with polling request */
				PreviousButton = BURN_IN;								/* tells SWDBin2() call is after gathering valid results */
				SWDBin2();												/* update GUI, set up JTAG for InterimRead call */

/* End   Polling Insertion - read status after each module download for characterization           */
/* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * */

		   } 												/* end of ModuleLoop */
	   	  }													/* end of StartButton != BIN2_CHECK run ModuleLoop */
	   	  else break;										/* exit NUMMODULES k++ loop */
	  	 }													/* end NUMMODULES k++ loop */

	  	 RESET_LOW;											/* Put device in Reset */
	  	 OUT0_31=0x00000000;								/* all output drivers low prior to exit, including RESET */
	  	 SetClocksOff();									/* all external inputs terminated low */

	 	}													/* end StartButton != BIN2_CHECK run NUMMODULES k++ loop */ 
	 	else break;											/* allows flow to exit project_loop */
	} 														/* end of project loop       */
} 															/* end of subroutine RunModules */

/***************************************************************************************/
/***************************************************************************************/
void SWD_AHB_CFG(int Button, UINT8 TestMode)
{
	extern VUINT16 *pStartButton;						/* indicates when START button is pressed for BI flow control */

	int	i = Button;										/* avoid compiler warning when CLEAR_NVM_SECURITY not defined */
	int ndx=0;

	UINT8  dispArray[5]="----";							/* used in count-down */	
	UINT32 ReadResult[SOCKET_COUNT];					/* for DP_ACC/AP_ACC, shift read results into array */

	RESET_LOW;											/* required for interim entry points, already low otherwise */
	WaitMicroSeconds(100000);							/* Delay 100mS */

	SWDResetToIdle();									/* reset JTAG port, select Run-Test/Idle state */		
	SWDReadReg(DPACC,DP_IDR, ReadResult);				/* required operation following reset */

	SWDWriteReg(DPACC,DP_CTRLSTAT,0x50000000);			/* sets CSYSPWRUPREQ, CDBGPWRUPREQ to enable access to debug  */
	WaitMicroSeconds(100000);							/* Delay 100mS */

#ifdef DEBUG
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);			/* check status from previous write, capture results */
#endif

	SWDWriteReg(DPACC,DP_ABORT,0x0000001F);				/* STICKYERR and others on SWD - clear with write  */

#ifdef DEBUG
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);			/* check status from previous write, capture results */
#endif


// Select the MDM-AP to perform system/debug reset, enable CPU hold, access test register
	SWDWriteReg(DPACC,DP_SELECT,MDMAP_SEL);				/* Selects MDM-AP for APACC access (Access Port 1) */

#ifdef DEBUG
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);			/* check status from previous write, capture results */
#endif


/***************************************************************************************/
#ifdef CLEAR_NVM_SECURITY

// While holding the external resetb pin low, request a mass erase by setting MDM-AP CSR bit 0.

	if (Button == QCHECK)								/* perform ONLY immediately prior to QCHECK */
	{
		DisplayScroll (FAST, "Mass Erase Enabled - ABORT BY PRESSING <<<<");
		WaitSeconds(1);								/* one second at a time */

		for(ndx=0;ndx<5;ndx++)
		{
			if (StartButton  == QCHECK)
			{
				sprintf(dispArray," %1ds ",5-ndx);		/* display shows count-down */
				DisplayChar(dispArray);					/* Display seconds before erase */
			
				WaitSeconds(1);							/* one second at a time */
			}
		}
		if (StartButton == QCHECK)						/* perform ONLY if operation not aborted */
		{
			DisplayChar("ERAS");
			SWDWriteReg(APACC,MDM_CR,0x00000001);		/* mass erase request */
			WaitSeconds(2);								/* time allowed to perform mass erase */

// Insert a POR to clear the MDM-AP Status Register MAss Erase Acknowledge Bit following the operation			
			VddRamp(HSVGData[QCHECK_PTR].downloadVoltage);

			SWDResetToIdle();							/* reset JTAG port, select Run-Test/Idle state */		
			SWDReadReg(DPACC,DP_IDR, ReadResult);		/* required operation following reset */
			SWDWriteReg(DPACC,DP_CTRLSTAT,0x50000000);	
			SWDWriteReg(DPACC,DP_ABORT,0x0000001F);		/* STICKYERR and others on SWD - clear sticky bit with write 1 to bit  */
			SWDWriteReg(DPACC,DP_SELECT,MDMAP_SEL);		/* Select the MDM-AP to perform system/debug reset, enable CPU hold */
		}
		else
		{
			DisplayScroll (FAST, "Mass Erase ABORTED !!!!");
			StartButton = QCHECK;						/* pushed to abort - restore original value for flow */
		}
	}
	
#endif
/***************************************************************************************/

// BURN_IN RL&E always in Functional Test Mode. Latch on rising edge of Reset.

	if (Button == BURN_IN)
	{
		if (TestMode == 1)
			SWDWriteReg(APACC,MDM_TR,FuncTestDAC);		/* 1: configure DAC, disengaged from core */
		else
			SWDWriteReg(APACC,MDM_TR,FuncTest);			/* 0: do not require DAC */
	WaitMicroSeconds(50000);							/* Delay 50mS after Test Register write */	
	}
	
// Execute system reset while maintaining CM4 Core Hold

	SWDWriteReg(APACC,MDM_CR,0x00000010);				/* clear system reset request (bit3), maintain CM4 Core Hold reset */

#ifdef DEBUG
	SWDReadReg(APACC,MDM_CR, ReadResult);			/* check status from previous write, capture results */
	SWDReadReg(APACC,MDM_CR, ReadResult);			/* check status from previous write, capture results */

	SWDReadReg(APACC,MDM_SR,ReadResult);				/* first read posts data to shift chain */
	SWDReadReg(APACC,MDM_SR,ReadResult);				/* first read posts data to shift chain */
#endif

