Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
	RESET_HIGH;											/* now resetb pin alone controls system reset */
	WaitMicroSeconds(100000);							/* Delay 2mS */


#ifdef DEBUG
// Debug Begin
// At this point, it is convenient to read the MDM-AP Status Register to confirm Reset/Security state
// Security should be disabled (bit 2 cleared), Reset should be released (bit 3 set). Normal read value 0x0000003A

	SWDReadReg(APACC,MDM_SR,ReadResult);				/* first read posts data to shift chain */
	SWDReadReg(APACC,MDM_SR,ReadResult);				/* second read shifts data out for capture */

	SWDReadReg(DPACC, DP_CTRLSTAT, ReadResult);			/* first read posts data to shift chain  */
//	SWDReadReg(DPACC, DP_CTRLSTAT, ReadResult);			/* second read shifts data out for capture */
// Debug End
#endif

// Select the AHB-AP to access RAM data transfer registers (debug access port 0, bank 0)

	SWDWriteReg(DPACC,DP_SELECT,AHBAP_SEL);				/* Selects AHB-AP for APACC access */
	
#ifdef DEBUG
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);			/* check status from previous write, capture results */
#endif

// Set up data transfer - AddrInc[5:4]=00 for NO autoincrement, Size[2:0]=010 for 32-bit writes

	SWDWriteReg(APACC,AHB_CSW,0x23000002);				/* Selects AHB-AP CSW for APACC access */

#ifdef DEBUG
	SWDReadReg(APACC,AHB_CSW, ReadResult);			/* check status from previous write, capture results */
	SWDReadReg(APACC,AHB_CSW, ReadResult);			/* check status from previous write, capture results */
#endif

// Now set the AHB_TAR to the address of the word targeted for read/write

}

/***************************************************************************************/
/***************************************************************************************/
void SWDInterimRead(UINT32 *InterimArray, int InterimDUTData, UINT32 InterimSize, UINT32 InterimLocation)
{

// Reorganized to facilitate debug. Always read target data into ReadResult.
// Do not copy into target InterimArray if previously stored data will be over-written.

	UINT32 ReadResult[SOCKET_COUNT];					/* for DP_ACC/AP_ACC, shift read results into array */
	int i;
	
// Clear any potential sticky errors from previous operations

	SWDWriteReg(DPACC,DP_ABORT,0x0000001F);			/* STICKYERR and others on SWD - clear sticky bit with write 1 to bit  */

// Set the AHB_TAR to the target address, read using AHB_DRW

	SWDWriteReg(APACC,AHB_TAR,InterimLocation);		/* Selects AHB-AP TAR for APACC access */

	SWDReadReg(APACC, AHB_DRW, ReadResult);			/* first read posts data to shift chain */
	SWDReadReg(APACC, AHB_DRW, ReadResult);			/* second read shifts data out for capture */

	if(GetDutDataLength(InterimDUTData) == 0)			/* if previous data has been logged, otherwise do not overwrite */
	{
		for (i = 0; i < SOCKET_COUNT; i++)
			InterimArray[i] = (QCHKResult[i] == Populated) ? ReadResult[i] : Unpopulated;	/* fill unpopulated sockets with blank data */
			
		EnableDutData(InterimDUTData,(UINT32)InterimArray,(UINT32)InterimSize);
	}
	
	WaitMicroSeconds(10000);				/* Default delay 10mS after completing operation */

}

/***************************************************************************************/
/***************************************************************************************/

void 	PolledDelay(UINT32 DelayTime)
{

#ifdef TARGET_HTOL

// Run stress in increments to allow test for polling request - will terminate procedure from operator interface
// Algorithm insures a non-zero value is always specified for the delay

	UINT32	TimeUsed,TimeRemaining;

	TimeUsed = 0;										/* Initialized for use in loop */
	while ( (StartButton != BIN2_CHECK) && (DelayTime > TimeUsed) )
	{
		TimeRemaining = DelayTime - TimeUsed;			/* deduct expended time from total */
		if (TimeRemaining > TimeSegment)				/* time remaining is less than the increment */	
		{
			WaitSeconds(TimeSegment);					/* check for Bin2 button every nn seconds */
			TimeUsed = TimeUsed + TimeSegment;
		}
		else
		{
			WaitSeconds(TimeRemaining);					/* check for Bin2 button every nn seconds */
			TimeUsed = TimeUsed + TimeRemaining;
		}					
	}
#endif

#ifdef TARGET_NVM
	WaitSeconds(DelayTime);								/* never interrupt a cycling download */
#endif
		
}

/***************************************************************************************/
/***************************************************************************************/
void VddRamp(int *NextVoltage)
{
	UINT16 status;
	UINT16 PreviousVdd;

	PreviousVdd = voltage[0]; 			/* VDUT1 current setting */

	DisplayChar("RAMP");

// prepare resources for ramp - terminate DUT inputs low and stop clocks ... ramp or no

	RESET_LOW; 							/* Rst = low */
	SetClocksOff();						/* clocks were driven low during ECB trip test */
	OUT0_31 = 0x00000000;				/* terminate all driver inputs low during POR */

	Vdut2Off();							/* turn off during ramp down */
	Vdut3Off();							/* turn off during ramp down */
	Vdut4Off();							/* turn off during ramp down */
	WaitSeconds(1);						/* Delay 1s while signals decay */ 

#ifdef DCDC_BUCK

// Buck uses VDUT1 for DCDC_in, VDUT3 for GPIO terminations. Use VDUT2/VDUT4 (not hooked up) to pass VIO/VIOZ levels

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range
// Do not use CC3 . . .
//	SET_VIO_VDUT4;	/*  VIO follows VDUT4 - after any power-off event, must redeclare any time you intend to restore voltage */
//	SET_VCLK_VDUT2;	/* VCLK follows VDUT2 - after any power-off event, must redeclare any time you intend to restore voltage */


// If 1st time we are powerng up, do not set VDUT1 on then off again . . .
	if (PreviousVdd != 0000)
	{
	SetVdut(1,800);					/*	try to give clean POR deassertion */
	WaitSeconds(2);

	Vdut1Off();							/* turn off supply to DCDC converter / Vdd in Bypass */
	WaitSeconds(2);						/* Delay 1s while signals decay */ 
	}

	voltage[0] = (UINT16)NextVoltage[0];
	voltage[1] = (UINT16)NextVoltage[1];
	voltage[2] = (UINT16)NextVoltage[2];		/* if not used, set to 0 */
	voltage[3] = (UINT16)NextVoltage[3];

