Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
	status = SetVdutsAll(voltage[0],voltage[1],voltage[2],voltage[3]);	
	if ((status != PASS)&&(status != VDUT_WARNING))
	{
		VdutsOff ();	
		DisplayToggle ("VDT1", "Fail");
	}		

	WaitMicroSeconds(StepDelay);		/* Delay n00ms  */

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf2((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf3((UINT16)voltage[3],DUTCODE);		/* Clocks tracks with VDUT4 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT4;						/*  VIO follows VDUT4 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT2;						/* VCLK follows VDUT2 - if powered-off, redeclare to restore voltage */
	}

	WaitSeconds(1);						/* Delay 1s while signals stabilize */ 	
	
#else
 #ifdef DCDC_BYPASS

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range
// Do not use CC3 . . .
//	SET_VIO_VDUT1;	/*  VIO follows VDUT1 - if powered-off, redeclare to restore voltage */
//	SET_VCLK_VDUT1;	/* VCLK follows VDUT1 - if powered-off, redeclare to restore voltage */

//	DisplayChar("RAMP");					/* voltages don't match, ramp to next level */
// ramp down to POR from previous voltage

// If 1st time we are powerng up, do not set VDUT1 on then off again . . .
	if (PreviousVdd != 0000)
	{
	SetVdut(1,800);					/*	try to give clean POR deassertion */
	WaitSeconds(2);

	Vdut1Off();							/* turn off supply to DCDC converter / Vdd in Bypass */
	WaitSeconds(2);						/* Delay 1s while signals decay */ 
	}

	voltage[0] = (UINT16)NextVoltage[0];
	voltage[1] = (UINT16)NextVoltage[1];
	voltage[2] = (UINT16)NextVoltage[2];		/* if not used, set to 0 */
	voltage[3] = (UINT16)NextVoltage[3];

	status = SetVdutsAll(voltage[0],voltage[1],voltage[2],voltage[3]);	
	if ((status != PASS)&&(status != VDUT_WARNING))
	{
		VdutsOff ();	
		DisplayToggle ("VDT1", "Fail");
	}		

	WaitMicroSeconds(StepDelay);		/* Delay n00ms  */

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf2(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf3(voltage[0],DUTCODE);		/* Clocks tracks with VDUT1 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT1;						/*  VIO follows VDUT1 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT1;						/* VCLK follows VDUT1 - if powered-off, redeclare to restore voltage */
	}

 #else
  #error "Select only one DCDC Converter Mode DCDC_BUCK or DCDC_BYPASS in procedure parameter s19data.h file"
 #endif
#endif

	SWD_Drive_ON;						/* may have been disabled due to mode muxing */
	WaitSeconds(1);						/* Delay 1s while signals stabilize */ 

} 										/* end of ramp-down /POR / ramp-up */

/***************************************************************************************/
/***************************************************************************************/

/***************************************************************************************/
/*   SetClocksInit - default clock configuration for Functional Mode                   */
/***************************************************************************************/

void SetClocksInit(void)
{
	SetClock(DUT_CLK1,PLL1,Fext,0);						/* EXTAL bank1 */
	SetClock(DUT_CLK2,CK1FB,0,0);						/* EXTAL bank2 */

	SetClock(DUT_CLK3,PWM1,32000,50);					/* not used    */
	SetClock(DUT_CLK4,PWM1,32000,50);					/* not used    */
}

/***************************************************************************************/
/*   SetClocksOff- temporarily disable clocks terminating pin input levels low         */
/***************************************************************************************/

void SetClocksOff(void)
{
	SetClockOptions(DUT_CLK1,1,DLY0,INV_OFF,OE_OFF_LOW); /* clock inputs held Lo for power-down */
	SetClockOptions(DUT_CLK2,1,DLY0,INV_OFF,OE_OFF_LOW);

	SetClockOptions(DUT_CLK3,1,DLY0,INV_OFF,OE_OFF_LOW);	
	SetClockOptions(DUT_CLK4,1,DLY0,INV_OFF,OE_OFF_LOW);	
}

/***************************************************************************************/
/*   SetClocksOn- enable clock inputs to pins (terminated low during power cyclng)     */
/***************************************************************************************/

void SetClocksOn(void)
{
	SetClockOptions(DUT_CLK1,1,DLY0,INV_OFF,OE_ON);		/* EXTAL bank1 */
	SetClockOptions(DUT_CLK2,1,DLY0,INV_OFF,OE_ON);		/* EXTAL bank2 */


//	SetClockOptions(DUT_CLK3,1,DLY0,INV_OFF,OE_ON);		/* not used */
	SetClockOptions(DUT_CLK3,1,DLY0,INV_OFF,OE_OFF_LOW);	

//	SetClockOptions(DUT_CLK4,1,DLY0,INV_OFF,OE_ON);		/* not used */
	SetClockOptions(DUT_CLK4,1,DLY0,INV_OFF,OE_OFF_LOW);	

}

/***************************************************************************************/

int SWDDownloadS19(struct burnInModule *module)
{
	int 	i,address,DataCharSize;
	char 	temp[20];								/* used to parse data of s19 for processing */
	UINT8	EndianMap[8]={6,7,4,5,2,3,0,1};			/* used to reverse s19 byte order for AP write */

// to perform the download, the DUT must first be configured for writes to RAM
// user 1st address in record line to set transfer address register
// use incremental word writes to transfer data to RAM

// resetb is currently held low. If required, Functional Test Mode will have been selected.
// Debug Port must be powered up in order to use access ports:

	SWD_AHB_CFG(BURN_IN,module->TestModeFlag);		/* always sets Regulated PMC Functional Test Mode for RAM Load */

// Prior to RAM download and execute, disable the Low Voltage Reset for running at lower operating limits
// Select 8-bit register access, no auto-increment to enable register write
	SWDWriteReg(APACC,AHB_CSW,0x23000000);			/* Selects AHB-AP CSW for APACC access, DO NOT DISTURB PROT BITS */
// Specify Target Address Register for LVR control
	SWDWriteReg(APACC,AHB_TAR,PMC_LVDSC1);			/* Selects AHB-AP TAR for APACC access - Low Voltage Detect Status And Control 1 register */
// Clear LVDRE bit in control register to disable low voltage resets
	SWDWriteReg(APACC,AHB_DRW,LVR_DISABLE);			/* Selects AHB-AP DRW for APACC access - clear LVDRE bit in control register */

