Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
//	DisableDutData(1);								/* prevent host from polling prior to data initialization */
//	SWDInterimRead(MISCData1,1,DatarrySize,PMC_LVDSC1);
//	MISCData1[0] = MISCData1[0] | 0xDEFE0000;

// Set up data transfer - AddrInc[5:4]=01 for autoincrement, Size[2:0]=010 for 32-bit writes

	SWDWriteReg(APACC,AHB_CSW,0x23000012);			/* Selects AHB-AP CSW for APACC access, DO NOT DISTURB PROT BITS */

// Now set the AHB_TAR to the address of the 1st word in each line in s-record, write the data on the line to AHB_DRW

// 32-bit S-Record Format: LL=length; AA=Address; DD=Data; CS=Checksum.
// S3LLAAAAAAAADDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDDCS
// 0123456789012345678901234567890123456789012345

// download until the string is END, end of S-Record found. 

	for (i=0; strcmp(module->TheFile.s19Record[i],"END")!=0; i++)
	   { 
		int m,charndx,numBytes,dataWord;

// Get the start address of the line of data

            char *theRecord=module->TheFile.s19Record[i];
            for(m=4;m<12;m++)						/* 4 byte address, 8 characters in string */
                temp[m-4]=theRecord[m];
            temp[m-4]='\0';
		address=StrToHex(temp);
 
// write address to AHB-AP Transfer Address Register at beginning of each line of S19
		
		SWDWriteReg(APACC,AHB_TAR,address);			/* Selects AHB-AP TAR for APACC access */

// Because ARM is strongly 16-bit aligned (not 32-bit), partial words may be contained on lines and must be accommodated.
// Determine the number of BYTES on the current line of the S-Record

            for(m=2;m<4;m++)						/* one byte character count, two characters in string */
                   temp[m-2]=theRecord[m];
            temp[m-2]='\0';							/* s19 contains byte count, not word count */

            numBytes=StrToHex(temp)-5;				/* convert character representation to number, adjust for address field and checksum */
            
// Convert one line of bytes into words / partial words - 1st data word character is always 12th string character

		m=12;										/* pointer to character in string during operation */
		while (numBytes)							/* combine bytes into longer values until all used */
		{

		DataCharSize = (numBytes >= 4) ? WordCharSize : numBytes*2; /* word or partial word */
		numBytes -= DataCharSize/2;					/* reduce remaining byte count */

// initialize temp array in case data is missing
			for (charndx = 0; charndx < WordCharSize; charndx++)
				temp[charndx]='0';					/* in case you don't overwrite a complete word, need to init string to zeroes */
// tricky ...
			for(charndx = WordCharSize-DataCharSize ; charndx < WordCharSize; charndx++)
				temp[charndx]=theRecord[m+EndianMap[charndx]]; /* words in s-record are Little-Endian, need to reverse */
			temp[WordCharSize]='\0';
	
			dataWord = StrToHex(temp);

// Transfer the current data word to target address in RAM

			SWDWriteReg(APACC,AHB_DRW,dataWord);	/* Selects AHB-AP DRW for APACC access */
			
			m += DataCharSize;						/* shift to next word / partial word */
      	}
	}
	return 1;
}

/***************************************************************************************/
/***************************************************************************************/

int StrToHex(char *convert)
{
	int i,multiply,word,temp;

   	for(i=0,word=0,multiply=strlen(convert)-1;convert[i]!='\0';i++,multiply--)
	{
		if(convert[i]=='A')							/* hex characters, convert to decimal equivalent */
		 temp = 10;
      	 else if(convert[i]=='B')
		  temp =11;
		  else if(convert[i]=='C')
		   temp=12;
		   else if(convert[i]=='D')
		    temp=13;
      	    else if(convert[i]=='E')
		     temp=14;
 		     else if(convert[i]=='F')
			temp=15;
 		      else
 			 temp=convert[i]-48;					/* numeric character, convert ANSI code to decimal equivalent ('0' = 0x30, 48 base 10) */
    
 		word = word + temp*power(16,multiply) ;
    	}
	return word;
}

/***************************************************************************************/
int power(int value,int power)
{
 	int i=0;
 	int result=1;
 	if(power==0)
      	return 1;

 	for(i=0;i<power;i++)
		result = result*value;
 
      return result;
}


/**********************************************************************************/

/*******************************************************************************/
/* FUNCTION                                                                    */ 
/*******************************************************************************/

/*******************************************************************************
FUNCTION        : Toggle_SWD_CLK
PURPOSE         : Toggles SWD_CLK the number of times specified.
INPUTS NOTES    : numClocks - number of SWD_CLK clock pulses
RETURNS NOTES   : void
GENERAL NOTES   : 
*******************************************************************************/

void Toggle_SWD_CLK (UINT32 numClocks)
{
	UINT32 i;
		
	WaitMicroSeconds(20);						/* Delay before continuing */

	for (i = 0; i < numClocks; i++)
	{
		SWD_CLK_HIGH;							/* capture occurs on rising edge, insure low to high transistion */
		WaitMicroSeconds(20);					/* Delay before continuing */
		SWD_CLK_LOW;
		WaitMicroSeconds(20);					/* Delay before continuing */
	}	

	WaitMicroSeconds(20);						/* Delay before continuing */
}

 // End of Toggle_SWD_CLK

/*******************************************************************************
FUNCTION        : ToggleTCLK
PURPOSE         : Toggles TCLK the number of times specified.
INPUTS NOTES    : numClocks - number of TCLK clock pulses
RETURNS NOTES   : void
GENERAL NOTES   : Based on CC2 TOG_TCLK.
                  **ad may want to delay this as the CC2 file delays
*******************************************************************************/
void ToggleTCLK (UINT32 numClocks)
{
	UINT32 i;
	
	WaitMicroSeconds(20);						/* Delay before continuing */

	for (i = 0; i < numClocks; i++)
	{
		TCLK_HIGH;								/* capture occurs on rising edge, insure low to high transistion */
		WaitMicroSeconds(20);					/* Delay before continuing */
		TCLK_LOW;
		WaitMicroSeconds(20);					/* Delay before continuing */
	}	

	WaitMicroSeconds(20);						/* Delay before continuing */
}
 // End of ToggleTCLK

