Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
/*******************************************************************************/

/*******************************************************************************
FUNCTION        : SWDResetToIdle()
PURPOSE         : performs a JTAG Reset and initialization of state machine
INPUTS NOTES    : 
RETURNS NOTES   : void
GENERAL NOTES   : 
*******************************************************************************/

void SWDResetToIdle(void)
{
	SWD_DIO_HIGH;
	Toggle_SWD_CLK(100);
	SWD_DIO_LOW;
	Toggle_SWD_CLK(100);
	
	WaitMicroSeconds(100000);					/* Delay before continuing */
}

/*******************************************************************************
FUNCTION        : JTAGResetToIdle()
PURPOSE         : performs a JTAG Reset and selects the Run - Test/Idle TAP State
INPUTS NOTES    : 
			sockets - pointer to array where a list of the dut return lines
			that are used.  sockets[0] = total number of sockets and the rest
			contain the return lines.
RETURNS NOTES   : void
GENERAL NOTES   : There is a one cycle delay when shifting, so toggle TCLK twice to shift TDI->TDO
*******************************************************************************/

void JTAGResetToIdle(void)
{
	TMS_LOW;									/* enables TAP Test-Logic-Reset state exit on next clock */
	JRESET_LOW;									/* insure JRESET is held high - leave high always */
	ToggleTCLK(10);								/* 5 TCLK rising edges guarantees TAP in Test-Logic-Reset state */

	TMS_HIGH;									/* To ensure deterministic operation of test logic, TMS high  while JRESET goes high. */
	JRESET_HIGH;								/* insure JRESET is held high - leave high always */
	ToggleTCLK(10);								/* 5 TCLK rising edges guarantees TAP in Test-Logic-Reset state */

	TMS_LOW;									/* enables TAP Test-Logic-Reset state exit on next clock */
	ToggleTCLK(10);								/* shift to TAP Run-Test/Idle state */

	WaitMicroSeconds(10000);					/* Delay before continuing */

} // 	END JTAGResetToIdle()

/*******************************************************************************
FUNCTION        : SWDWriteReg()
PURPOSE         : performs a JTAG DR Write/Update.
INPUTS NOTES    : Check defines for DR command names corresponding to various register selects.
                  
RETURNS NOTES   : void
GENERAL NOTES   : 
                : 
*******************************************************************************/
void SWDWriteReg(UINT8 DPAP, UINT8 DPAPAddr, UINT32 DPAPCode)
{
	int 	i, parity;	
	UINT8 	dut;
	UINT8 	ack;

	int		RegisterSize=32;
	UINT32 	DRmask;

	UINT8	DAP_ACK[SOCKET_COUNT];				/* for DP_ACC/AP_ACC, 1st 3 bits [2:0] returned are ACKnowledge */

//	QSMCM.PQSPAR.B.QPAMISO=0;					/* Use MISO as general purpose input from DUT_MUX */

// Begin write sequence

	parity = 0;									/* initialize, need to calculate parity bit for preamble */

// Start Bit - A single start bit, with value 1

	SWD_DIO_HIGH;								/* set SWD_DIO to '1' for start bit */

	Toggle_SWD_CLK(1);							/* next state */
	
// APnDP A single bit, indicating whether the Debug Port or the Access Port Access Register is to be accessed. This bit is 0 for an DPACC access, or 1 for a APACC access.

	switch (DPAP)								/* select register bit in command string based on port accessed */
	{
		case DPACC :							/* */
		{
			SWD_DIO_LOW;						/* set to '0' for DPACC */
			break; 								/* exit case, proceed  */ 
		} 										/* end case DPACC */
		case APACC :							/*  */
		{
			SWD_DIO_HIGH;						/* set to '1' for APACC */
			parity++;							/* increment count of bits set to one for parity calcuation */				
			break;						
		}										/* end case APACC */
	}											/* end of switch */

	Toggle_SWD_CLK(1);							/* next state */
	
// RnW A single bit, indicating whether the access is a read or a write. This bit is 0 for an write access, or 1 for a read access.

	SWD_DIO_LOW;								/* set to '0' for write */
					
	Toggle_SWD_CLK(1);							/* next state */

// A[2:3] Two bits, giving the A[3:2] address field for the DP or AP Register Address:
// For a DPACC access, the A[3:2] value is the address of the register in the SW-DP
// register map, see SW-DP Register Map on page 6-5.
// For an APACC access, the register being addressed depends on the A[3:2] value and
// the value held in the SELECT register. 
// The A[3:2] value is transmitted Least Significant Bit (LSB) first on the wire.

	DPAPAddr >>= 2;								/* use DRmask to determine SWD_DIO for address field */
	for (i=0,DRmask=0x01; i<2; i++,DRmask<<=1)	/* address field is two bits wide */
	{
		if ((DPAPAddr & DRmask) != 0)
		{
			
			SWD_DIO_HIGH;						/* non-zero value indicates bit is high */
			parity++;							/* increment count of bits set to one for parity calcuation */				
		}
		else
			SWD_DIO_LOW;

		Toggle_SWD_CLK(1);						/* next state */
	}

// Parity A single parity bit for the preceding packet.
// The parity check is made over the APnDP, RnW and A[2:3] bits. If, of these four bits:
// the number of bits set to 1 is odd, then the parity bit is set to 1
// the number of bits set to 1 is even, then the parity bit is set to 0.

	if ((parity & 1) != 0)
		SWD_DIO_HIGH;							/* non-zero value indicates odd bit count, parity bit is high */
	else
		SWD_DIO_LOW;

	Toggle_SWD_CLK(1);							/* next state */

// Stop A single stop bit. In the synchronous SWD protocol this is always 0.

	SWD_DIO_LOW;
	Toggle_SWD_CLK(1);							/* next state */

// Park A single bit. The host must drive the Park bit HIGH to park the line before tristating it for the
// turnaround period. This ensures the line is read as HIGH by the target. This is required as the pull-up
// on the Serial Wire Debug interface is weak. The target reads this bit as 1.

	SWD_DIO_HIGH;								/* non-zero value indicates odd bit count, parity bit is high */
	Toggle_SWD_CLK(1);							/* next state */

// Trn Turnaround. This is a period during which the line is not driven and the state of the line is
// undefined. The length of the turnaround period is controlled by the TURNROUND field in
// the Wire Control Register, see The Wire Control Register, WCR (SW-DP only) on page 6-18.
// The default setting is a turnaround period of one clock cycle.

// To avoid shadow results on monitor lines of unpopulated sockets, do not tri-state
	SWD_Drive_OFF;								/*  drivers for SWD_DIO off */

// ACK[0:2] A three-bit target-to-host response. 001 = 
// Note
// The ACK value is transmitted LSB-first on the wire ( ACK[0:2] ).

	for (ack = 0; ack<3; ack++)					/* ACKnowledge field is three bits wide */
	{
		Toggle_SWD_CLK(1);						/* shift out acknowledge bit */
		for (dut=0,DRmask=0x01; dut < DutNumbers[0]; dut++,DRmask<<=1 )		
		{
			DUT_MUX = DutNumbers[dut+1]-1;  	/* ignore non-existing return lines */
			DAP_ACK[dut] = (DUT_INPUT == 1) ? (DAP_ACK[dut] |= DRmask) : (DAP_ACK[dut] &= ~DRmask);
		}
	}

// Behavior on scope looks like DUT parks line, tri-state SWD_DIO
// Park A single bit. The host must drive the Park bit HIGH to park the line before tristating it for the
// turnaround period. This ensures the line is read as HIGH by the target. This is required as the pull-up
// on the Serial Wire Debug interface is weak. The target reads this bit as 1.

	Toggle_SWD_CLK(1);							/* clocked/park/tri-state at end of ACK loop */

