Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
// Trn Turnaround. This is a period during which the line is not driven and the state of the line is
// undefined. The length of the turnaround period is controlled by the TURNROUND field in
// the Wire Control Register, see The Wire Control Register, WCR (SW-DP only) on page 6-18.
// The default setting is a turnaround period of one clock cycle.
// after tri-state period, engage driver

// To avoid shadow results on monitor lines of unpopulated sockets, do not tri-state
	SWD_Drive_ON;								/*  drivers for SWD_DIO on */
	Toggle_SWD_CLK(1);							/* clocked/tri-state at end of ACK loop */

// WDATA[0:31] 32 bits of write data, from host to target.
// Note - The WDATA value is transmitted LSB-first on the wire hence representation WDATA[0:31]

	for (i=0,parity=0,DRmask=0x00000001; i<RegisterSize; i++, DRmask <<= 1)
	{
		if ((DPAPCode & DRmask) != 0)
		{	
			SWD_DIO_HIGH;						/* non-zero value indicates bit set */
			parity++;							/* calculate parity */
		}
		else
			SWD_DIO_LOW;

		Toggle_SWD_CLK(1);						/* shift bit into DR */
	}

// Parity A single parity bit for the preceding packet.
// The parity check is made over the APnDP, RnW and A[2:3] bits. If, of these four bits:
// the number of bits set to 1 is odd, then the parity bit is set to 1
// the number of bits set to 1 is even, then the parity bit is set to 0.

	if ((parity & 1) != 0)
		SWD_DIO_HIGH;							/* non-zero value indicates odd bit count, parity bit is high */
	else
		SWD_DIO_LOW;

	Toggle_SWD_CLK(1);							/* next state */

// Stop A single stop bit. In the synchronous SWD protocol this is always 0.

	SWD_DIO_LOW;
	Toggle_SWD_CLK(1);							/* next state */

// Trn By default, there are single-cycle turnaround periods between the first and second of these phases, and after the third phase
// During a Write sequence, there is NO Turnaround after the third phase.

//	Toggle_SWD_CLK(1);							/* next state, turn around */
		
// If a SW-DP is implemented with a synchronous serial interface, the host must continue to clock the interface
// for a number of cycles after the data phase of any data transfer. This ensures that the transfer can be clocked
// through the SW-DP. This means that after the data phase of any transfer the host must do one of the
// following:
//  - immediately start a new SW-DP operation;
//  - continue to clock the SW-DP serial interface until the host starts a new SW-DP operation;
//  - after clocking out the data parity bit, continue to clock the SW-DP serial interface until it has clocked
//    out at least 8 more clock rising edges, before stopping the clock.

	SWD_DIO_LOW;								/* next start bit is high */
	Toggle_SWD_CLK(10);							/* next state */

	WaitMicroSeconds(10000);					/* Default delay 10mS after completing operation */

}
/*******************************************************************************
FUNCTION        : SWDReadDR()
PURPOSE         : performs a JTAG DR Read, returns to idle state.
INPUTS NOTES    : Check defines for DR command names corresponding to various register selects.
RETURNS NOTES   : All read calls must conform to storage array parameters. Pass in pointer to results array.
GENERAL NOTES   : Separate local array records 3-bit acknowledge for DP/AP-ACC.
*******************************************************************************/

void SWDReadReg(UINT8 DPAP, UINT8 DPAPAddr, UINT32 *RdRslt)
{
	int 	i, parity;	
	UINT8 	dut;
	UINT8 	ack;

	int		RegisterSize=32;
	UINT32 	DRmask;

	UINT8	DAP_ACK[SOCKET_COUNT];				/* for DP_ACC/AP_ACC, 1st 3 bits [2:0] returned are ACKnowledge */

//	QSMCM.PQSPAR.B.QPAMISO=0;					/* Use MISO as general purpose input from DUT_MUX */

// Begin read sequence

	parity = 0;									/* need to calculate parity bit for preamble */

// Start Bit - A single start bit, with value 1

	SWD_DIO_HIGH;								/* set SWD_DIO to '1' for start bit */

	Toggle_SWD_CLK(1);							/* next state */
	
// APnDP A single bit, indicating whether the Debug Port or the Access Port Access Register is to be accessed. This bit is 0 for an DPACC access, or 1 for a APACC access.

	switch (DPAP)								/* select register bit in command string based on port accessed */
	{
		case DPACC :							/* */
		{
			SWD_DIO_LOW;						/* set to '0' for DPACC */
			break; 								/* exit case, proceed  */ 
		} 										/* end case DPACC */
		case APACC :							/*  */
		{
			SWD_DIO_HIGH;						/* set to '1' for APACC */
			parity++;							/* increment count of bits set to one for parity calcuation */				
			break;						
		}										/* end case APACC */
	}											/* end of switch */

	Toggle_SWD_CLK(1);							/* next state */
	
// RnW A single bit, indicating whether the access is a read or a write. This bit is 0 for an write access, or 1 for a read access.

	SWD_DIO_HIGH;								/* set to '1' for read */
	parity++;									/* increment count of bits set to one for parity calcuation */				
					
	Toggle_SWD_CLK(1);							/* next state */

// A[2:3] Two bits, giving the A[3:2] address field for the DP or AP Register Address:
// For a DPACC access, the A[3:2] value is the address of the register in the SW-DP
// register map, see SW-DP Register Map on page 6-5.
// For an APACC access, the register being addressed depends on the A[3:2] value and
// the value held in the SELECT register. 
// The A[3:2] value is transmitted Least Significant Bit (LSB) first on the wire.

	DPAPAddr >>= 2;								/* use DRmask to determine SWD_DIO for address field */
	for (i=0,DRmask=0x01; i<2; i++,DRmask<<=1)	/* address field is two bits wide */
	{
		if ((DPAPAddr & DRmask) != 0)
		{
			
			SWD_DIO_HIGH;						/* non-zero value indicates bit is high */
			parity++;							/* increment count of bits set to one for parity calcuation */				
		}
		else
			SWD_DIO_LOW;

		Toggle_SWD_CLK(1);						//* next state */
	}

// Parity A single parity bit for the preceding packet.
// The parity check is made over the APnDP, RnW and A[2:3] bits. If, of these four bits:
// the number of bits set to 1 is odd, then the parity bit is set to 1
// the number of bits set to 1 is even, then the parity bit is set to 0.

	if ((parity & 1) != 0)
		SWD_DIO_HIGH;							/* non-zero value indicates odd bit count, parity bit is high */
	else
		SWD_DIO_LOW;

	Toggle_SWD_CLK(1);							/* next state */

