Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
// Stop A single stop bit. In the synchronous SWD protocol this is always 0.

	SWD_DIO_LOW;								/* stop bit drives SWD_DIO low */
	Toggle_SWD_CLK(1);							/* next state */

// Park A single bit. The host must drive the Park bit HIGH to park the line before tristating it for the
// turnaround period. This ensures the line is read as HIGH by the target. This is required as the pull-up
// on the Serial Wire Debug interface is weak. The target reads this bit as 1.

	SWD_DIO_HIGH;								/* park line high for turn-around */
	Toggle_SWD_CLK(1);							/* next state */


// Trn Turnaround. This is a period during which the line is not driven and the state of the line is
// undefined. The length of the turnaround period is controlled by the TURNROUND field in
// the Wire Control Register, see The Wire Control Register, WCR (SW-DP only) on page 6-18.
// The default setting is a turnaround period of one clock cycle.

// !!!!
// To avoid reflections on unpopulated sockets, driver must be held high - causing contention and limiting bank size.
// Knowing which sockets are unpopulated enables them to be excluded during reads - identified in Q-Check.
// This allows polling to be performed with driver tri-stated, and reflections to be removed after reading all sockets.
// The only time we will NOT ! do this is during Q-Check when capturing the QCHKResult where driver termination eliminates ghosting.

	if (RdRslt != QCHKResult)
		SWD_Drive_OFF;							/*  drivers for SWD_DIO off except during Q-Check */

// ACK[0:2] A three-bit target-to-host response.
// Note
// The ACK value is transmitted LSB-first on the wire ( ACK[0:2] ).

	for (ack = 0; ack<3; ack++)					/* ACKnowledge field is three bits wide */
	{
		Toggle_SWD_CLK(1);						/* next bit */
		for (dut=0,DRmask=0x01; dut < DutNumbers[0]; dut++,DRmask<<=1 )		
		{
			DUT_MUX = DutNumbers[dut+1]-1;  	/* ignore non-existing return lines */
			DAP_ACK[dut] = (DUT_INPUT == 1) ? (DAP_ACK[dut] |= DRmask) : (DAP_ACK[dut] &= ~DRmask);
		}
	}

// A successful read operation consists of three phases:
// an eight-bit read packet request, from the host to the target
// a three-bit OK acknowledge response, from the target to the host
// a 33-bit data read phase, where data is transferred from the target to the host.
// By default, there are single-cycle turnaround periods between the first and second of these phases, and after
// the third phase. See the description of Trn in Key to illustrations of operations on page 5-5 for more
// information. However, there is NO turnaround period between the second and third phases, because the line
// is driven by the target in both of these phases.

	for (i=0,DRmask=0x01; i<RegisterSize; i++,DRmask<<=1)
	{
		Toggle_SWD_CLK(1);						/* next bit */
		WaitMicroSeconds(1000);					/* Delay 2mS */
		for (dut = 0; dut < DutNumbers[0]; dut++)		
		{
			DUT_MUX = DutNumbers[dut+1]-1;  	/* ignore non-existing return lines */
			RdRslt[dut] = (DUT_INPUT == 1) ? (RdRslt[dut] |= DRmask) : (RdRslt[dut] &= ~DRmask); /* see note */
		}
	}

// Note:
// Rather than using a relatively complex statement to filter out NRDs (and ghosts), kill ghost post population of read array
// The statement in the loop above would look something like this if they were combined:
//			RdRslt[dut] = (QCHKResult[dut]!=SecurityVal) ? Unpopulated : (DUT_INPUT == 1) ? (RdRslt[dut] |= DRmask) : (RdRslt[dut] &= ~DRmask);
// In this way, the actual polling loop gathers data in a manner consistent with M4/M7 full JTAGc implementations

#ifndef DEBUG

	for (dut = 0; dut < DutNumbers[0]; dut++)		
	{
		if (QCHKResult[dut] != Populated)		/* data captured on 1st read during Q-check is overwritten on 2nd read ... regardless */
			RdRslt[dut] = Unpopulated;			/* eliminates reflected data image due to adjacent sockets */
	}

#endif

// Parity Data transfers (WDATA and RDATA)
// The parity check is made over the 32 data bits, WDATA[0:31] or RDATA[0:31]. If, of these 32 bits:
// the number of bits set to 1 is odd, then the parity bit is set to 1
// the number of bits set to 1 is even, then the parity bit is set to 0.

// For CC-3 data reads, discard the parity bit. 32-bit register value has been captured into array

	Toggle_SWD_CLK(1);							/* next state, turn around */

// Trn By default, there are single-cycle turnaround periods between the first and second of these phases, and after the third phase

	Toggle_SWD_CLK(1);							/* next state, turn around */
		
// If a SW-DP is implemented with a synchronous serial interface, the host must continue to clock the interface
// for a number of cycles after the data phase of any data transfer. This ensures that the transfer can be clocked
// through the SW-DP. This means that after the data phase of any transfer the host must do one of the
// following:
//  - immediately start a new SW-DP operation;
//  - continue to clock the SW-DP serial interface until the host starts a new SW-DP operation;
//  - after clocking out the data parity bit, continue to clock the SW-DP serial interface until it has clocked
//    out at least 8 more clock rising edges, before stopping the clock.

	SWD_DIO_LOW;								/* drive pin low at end of read operation */

// !!!!
// To avoid reflections on unpopulated sockets, driver must be held high - causing contention and limiting bank size.
// Knowing which sockets are unpopulated enables them to be excluded during reads - identified in Q-Check.
// This allows polling to be performed with driver tri-stated, and reflections to be removed after reading all sockets.
// The only time we will NOT ! do this is during Q-Check when capturing the QCHKResult where driver termination eliminates ghosting.

	if (RdRslt != QCHKResult)
		SWD_Drive_ON;							/* drivers for SWD_DIO on - already enabled if running Q-Check */

	Toggle_SWD_CLK(10);							/* next state */

	WaitMicroSeconds(10000);					/* Default delay 10mS after completing operation */

}


/*******************************************************************************
FUNCTION        : SWDGo()
PURPOSE         : Release Core Hold in MDM-AP Control Register to start execution of RAM loaded code.
INPUTS NOTES    : void
RETURNS NOTES   : void
GENERAL NOTES   : 
*******************************************************************************/

void SWDGo(void)
{
// Select the MDM-AP to perform system/debug reset, enable CPU hold
	SWDWriteReg(DPACC,DP_SELECT,MDMAP_SEL);		/* Select the MDM-AP to perform system/debug reset, enable CPU hold */

// Clear the Code Hold bit in the MDM-AP COntrol Register to start execution
	SWDWriteReg(APACC,MDM_CR,0x00000000);		/* clear CM4 Core Hold reset */

// CODE IS NOW EXECUTING

// Select the AHB-AP to access RAM data transfer registers (debug access port 0, bank 0) during execution
	SWDWriteReg(DPACC,DP_SELECT,AHBAP_SEL);		/* Select the AHB-AP  */

// Set up data transfer - AddrInc[5:4]=00 for NO autoincrement, Size[2:0]=010 for 32-bit writes
	SWDWriteReg(APACC,AHB_CSW,0x23000002);		/* Selects AHB-AP CSW for APACC access */
}


