Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
/*******************************************************************************/
/*******************************************************************************/

/*******************************************************************************
FUNCTION        : SWDPatchReset()
PURPOSE         : Enable FLASH Patch and Breakpoint Unit to overwrite reset vectors to start execution of RAM loaded code.
INPUTS NOTES    : void
RETURNS NOTES   : void
GENERAL NOTES   : Call with AHB-AP selected
*******************************************************************************/

/* 
Reset Patch takes advantage of the current flow in that:
 - 1. AHB-AP Bank 0 is currently selected
 - 2. Automatic address increment is enabled
 - 3. 32-bit data transfer is selected
 - 4. APACC is current JTAG instruction
Otherwise setup for RAM Load would need to be duplicated.
*/
/******************************************************************************/
void SWDPatchReset(void)
{

// patch reset vectors to access RAM using VTOR - Target Address defined as Remap_Base in header

// Now enable the FLASH Patch Breakpoint for the two vector fetches - auto-increment still enabled for addressing
// Set Transfer Address Register to point at first register in FPB

	SWDWriteReg(DPACC,DP_SELECT,AHBAP_SEL);		/* Selects AHB-AP TAR for APACC access */

	SWDWriteReg(APACC,AHB_TAR,VTOR);			/* Set target location in TAR for APACC memory access */
	SWDWriteReg(APACC,AHB_DRW,Remap_Base);		/* check status from previous write, capture results */
}

/*******************************************************************************/

/*******************************************************************************
FUNCTION        : BI_SCAN
PURPOSE         : exercise logic using Burn-in Dynamic SCAN Mode
INPUTS NOTES    : module structure passes in control values
RETURNS NOTES   : populates array of captured SCAN output for logging
GENERAL NOTES   : 
*******************************************************************************/
void SWD_BI_SCAN(struct HSVGModule *module, UINT32 *SCANData,UINT32 *SCANMode)
{
	UINT32	EnterTime, DisplayTime, TimeToRun,TimeUsed,TimeRemaining;
	UINT32 *data_ptr;
	UINT32 CaptureEnable=0x0000001C;				/* POINTER 'WORD' OFFSET- clears WRAP bit from 1st block stimulus to enable 2nd */
	UINT32 DataMask;
	UINT16 status;
	int	   dut;

	UINT32 ReadResult[SOCKET_COUNT];				/* used in data capture  */

	EnterTime = ReadSeconds();								/* deduct ramp, RAM Load and message scroll from execution time */

	DisableDutData(0);								/* SCAN data logs - avoid capture during array manipulation */
	DisableDutData(5);								/* Operating Mode - avoid capture during array manipulation */

// Stimulus during exercise is provided by HSVG (staggered clock sequences).
// Set up vector memory prior to calling procedure

	SCAN_HSVG_INIT(module);							/* initialize HSVG, load up vectors for SCAN stimulus */

// BURN-IN SCAN Re-uses the TestKompress EDT decompressor to generate pseudo-random sequences.
// These are clocked throughout the scanned logic to toggle input and output nodes.
// A single "observe" output from one of the compactor outputs allows monitoring of toggle activity.
// Patterns are generated functionally and toggle coverage can be measured using simulation.

/*
	Dynamic Burnin Setup Sequence:
	1. Apply power to all supplies.
	2. Enter Dynamic Burnin mode thru BDM 
 	3. Set scan_se (pta6) to 1
	4. Set edt_update(pta7) to 1
	5. Apply a clock pulse to edt_clk (pta5)
	6. Set edt_update (pta7) to 0
*/
	VddRamp(module->downloadVoltage);				/* ramp down to POR, then up; clocks, all I/P low */

	SWDResetToIdle();								/* reset JTAG port, select Run-Test/Idle state */		
	SWDReadReg(DPACC,DP_IDR, ReadResult);			/* required operation following reset */
	SWDWriteReg(DPACC,DP_CTRLSTAT,0x50000000);		/* sets CSYSPWRUPREQ, CDBGPWRUPREQ */

#ifdef DEBUG
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);		/* check status from previous write, capture results */
#endif

	SWDWriteReg(DPACC,DP_ABORT,0x0000001F);			/* STICKYERR and others on SWD - clear sticky bit with write 1 to bit  */

#ifdef DEBUG
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);		/* check status from previous write, capture results */
#endif

	SWDWriteReg(DPACC,DP_SELECT,MDMAP_SEL);			/* Select the MDM-AP to perform system/debug reset, enable CPU hold */

	if(module->TestModeFlag == 1)					/* If flag set, select functional test mode with voltage override */
	{
		SWDWriteReg(APACC, MDM_TR, BISCAN_DAC);
		Toggle_SWD_CLK(50);							/* wait while voltage stabilizes before applying to bus */
		SWDWriteReg(APACC, MDM_TR, BISCAN_PMC);
		Toggle_SWD_CLK(10);							/* wait while voltage stabilizes before applying to bus */
	}
	else
	{
		SWDWriteReg(APACC, MDM_TR, BISCAN);
		Toggle_SWD_CLK(10);							/* wait while voltage stabilizes before applying to bus */
	}


	SWDReadReg(APACC, MDM_TR, SCANMode);			/* check status from previous write, capture results */
	SWDReadReg(APACC, MDM_TR, SCANMode);			/* data is posted on first read, captured on second  */
	EnableDutData(5,(UINT32)SCANMode, DatarrySize);

	Toggle_SWD_CLK(10);								/* wait while voltage stabilizes before applying to bus */

	if(module->downloadDelay!=0)
		WaitSeconds(module->downloadDelay);
			
	voltage[0]=module->runVoltage[0];
	voltage[1]=module->runVoltage[1];
	voltage[2]=module->runVoltage[2];
	voltage[3]=module->runVoltage[3];

	status = SetVdutsAll((UINT16)voltage[0],(UINT16)voltage[1],(UINT16)voltage[2],(UINT16)voltage[3]);	
	if ((status != PASS)&&(status != VDUT_WARNING))
	{
		VdutsOff ();	
		DisplayToggle ("VDT1", "Fail");
	}

	WaitMicroSeconds(100000);						/* Delay 50mS */

#ifdef DCDC_BUCK

// Buck uses VDUT1 for DCDC_in, VDUT2 for VIO/VIOZ terminations, VDUT4 for GPIO.
// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf2((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf3((UINT16)voltage[3],DUTCODE);		/* Clocks tracks with VDUT4 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT4;						/*  VIO follows VDUT4 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT2;						/* VCLK follows VDUT2 - if powered-off, redeclare to restore voltage */
	}

#else
 #ifdef DCDC_BYPASS

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf2(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf3(voltage[0],DUTCODE);		/* Clocks tracks with VDUT1 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT1;						/*  VIO follows VDUT1 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT1;						/* VCLK follows VDUT1 - if powered-off, redeclare to restore voltage */
	}

 #else
  #error "Select only one DCDC Converter Mode DCDC_BUCK or DCDC_BYPASS in procedure parameter s19data.h file"
 #endif
#endif

	DisplayChar("SCAN");							/* driver LED display */

	SCAN_CLK_LOW;									/* Dynamic Burnin Setup Sequence */
	EDT_CLK_LOW;										

	EDT_UPDATE_LOW;
	SCAN_SE_LOW;

	SWD_Drive_OFF;									/* at mode entry, disable drivers on SWD_DIO */
	RESET_HIGH;

