Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
/*
	Initializing TK Logic and scan chains (to known state for simulation)

	Repeat the following clocking sequence (maximum chain length) times to initialize 
	the decompressor and scan chains. (minimum
	of (maximum chain length) is needed in simulation
	to clear last X's from chains)
	1. Apply clock pulse to all internal clocks on extal, xtal and other
	2. Apply clock pulse to edt_clk ()
	Next, apply the following sequence to initialize the TK Compactor
	to a deterministic starting state:
	1. Set scan_se () to 1
	2. Set edt_update () to 1
	3. Apply a clock pulse to edt_clk ()
	4. Set edt_update () to 0
*/

	Toggle_SWD_CLK(10);								/* insure mode latched across clock boundaries */
	
	SCAN_SE_HIGH;									/* configure deterministic state */
	EDT_UPDATE_HIGH;
	TOGGLE_EDT_CLOCK(1);
	EDT_UPDATE_LOW;
	
	TOGGLE_SCAN_CLOCKS(200);						/* toggles EXTAL/SCAN_CLK and EDT_CLK with non-overlapping transitions */

	SCAN_SE_HIGH;									/* configure deterministic state */
	EDT_UPDATE_HIGH;
	TOGGLE_EDT_CLOCK(1);
	EDT_UPDATE_LOW;
	
	TOGGLE_SCAN_CLOCKS(200);						/* toggles EXTAL/SCAN_CLK and EDT_CLK with non-overlapping transitions */

/*
	Shift Path and PRPG (Pseudo-random pattern gen.) Clocking Sequence:
	1. Apply a clock pulse to all internal clocks on extal, xtal and ptb4 [shift chains once]
	2. Apply a clock pulse to edt_clk (pta5) {updates new ps-random data]
	3. (optional) Observe output pin (ptc2) for chain output activity.
*/

	SetIO ( 4, HSVG, 1, INV_OFF);					/* OUT4/PCLK drives EXTAL/SCAN_CLK  */

	SetIO ( 2, HSVG, 1, INV_OFF);					/* OP.2 drives XTAL/EDT_CLK bank 1  */
	SetIO ( 3, HSVG, 1, INV_OFF);					/* OP.3 drives XTAL/EDT_CLK bank 2  */

	SetIO (16, HSVG, 1, INV_OFF);					/* OP.16 drives SCAN_SE bank 1 */
	SetIO (17, HSVG, 1, INV_OFF);					/* OP.17 drives SCAN_SE bank 2 */

	SetClock(DUT_CLK1,PCLK,0,0);					/* EXTAL (CLK1) uses PCLK/OUT4 as source */
	SetClockOptions(DUT_CLK1,1,DLY0,INV_OFF,OE_ON);	/* SCAN Clk / EXTAL bank 1 */

	SetClock(DUT_CLK2,PCLK,0,0);					/* EXTAL (CLK1) uses PCLK/OUT4 as source */
	SetClockOptions(DUT_CLK2,1,DLY0,INV_OFF,OE_ON);	/* SCAN Clk / EXTAL bank 2 */

	DisplayTime = (ReadSeconds()) - EnterTime; 		/* adjust execution time to avoid drift in duration */
	TimeToRun = module->seconds - DisplayTime;			

//	RunHsvg(module->ExecuteAddress, module->seconds-CapturePortion , REPEAT);	/* ENABLE THE HSVG - SCAN */

// Run stress in segments to allow test for polling request - will terminate procedure from operator interface 
// It is critical that the algorithm insures a non-zero value is always specified for the delay

	TimeUsed = 0;									/* Initialized for use in loop */
	while ( (StartButton != BIN2_CHECK) && (TimeToRun-CapturePortion > TimeUsed) )
	{
		TimeRemaining = module->seconds - TimeUsed;	/* deduct expended time from total */
		if (TimeRemaining > TimeSegment)			/* time remaining is less than the increment */	
		{
			RunHsvg(module->ExecuteAddress, TimeSegment, REPEAT);	/* ENABLE THE HSVG - SCAN / BIST */			
			TimeUsed = TimeUsed + TimeSegment;
		}
		else
		{
			RunHsvg(module->ExecuteAddress, TimeRemaining, REPEAT);	/* ENABLE THE HSVG - SCAN / BIST */			
			TimeUsed = TimeUsed + TimeRemaining;
		}					
	}

/*
	Capture Path Sequence: (extal, xtal and ptb4 clocks d-inputs to Flops, disrupts PRPG)
	1. Set scan_se (pta6) to 0   [change flop inputs from shift to functional cap.]
	2. Apply a clock pulse to all internal clocks on extal, xtal and ptb4
	3. Set scan_se (pta6) to 1 [change from functional cap. back to shift mode]
*/

// Vectors are already initialized in HSVG memory.
// Clear WRAP bit in first block of vectors to allow/include execution of Captures in SCAN stimulus.

	data_ptr = (UINT32 *)(module->ExecuteAddress+CaptureEnable);
	*(data_ptr) = 0x00003000;								

	if(StartButton != BIN2_CHECK)
	RunHsvg(module->ExecuteAddress, CapturePortion, REPEAT); /* ENABLE THE HSVG - SCAN */

/*
	Reset Activity Sequence:
	1. Set RESET to 0  [asynchronous resets (or sets) may be exercised]
	2. Apply clock pulse to all internal clocks on extal, xtal and ptb4
		[activates synch. resets/sets]
	3. (optional) Apply a clock pulse to edt_clk (pta5)

	Example Dynamic Burn-in sequences to get maximal toggle coverage and also
	exercise functional captures/resets:
	1. Apply the Setup Sequence once, followed by the Initialization Sequence.
	2. Repeat the Shift-path sequence for 95% of dynamic burnin time without
	   captures.  This assures the maximal amount of non-repeating
	   pseudo-random data, needed to reach hard-to-toggle logic such as large
	   decoders.
	3. Follow this with the last 5% of dynamic burnin time being a mixed set of 
	   Capture & Shift-path sequences to exercise the d/si input multiplexer of
	  flip-flops.  The Reset sequence can also be mixed into this last segment
	  for exercising asynchronous and synchronous set/reset paths.
*/

// Restore control of driver resources to output commands

	SCAN_CLK_LOW;									/* avoid pulse when restoring clocks to driver control from HSVG */
	EDT_CLK_LOW;

	SetIO ( 4, IO, 1, INV_OFF);						/* OUT4/PCLK drives EXTAL/SCAN_CLK  */

	SetIO ( 2, IO, 1, INV_OFF);						/* OP.2 drives XTAL/EDT_CLK bank 1  */
	SetIO ( 3, IO, 1, INV_OFF);						/* OP.3 drives XTAL/EDT_CLK bank 2  */

	SetIO (16, IO, 1, INV_OFF);						/* OP.16 drives SCAN_SE bank 1 */
	SetIO (17, IO, 1, INV_OFF);						/* OP.17 drives SCAN_SE bank 2 */

	SCAN_SE_HIGH;									/* flushes chains, loads deterministic data */
	EDT_UPDATE_HIGH;
	TOGGLE_EDT_CLOCK(1);
	EDT_UPDATE_LOW;
	TOGGLE_SCAN_CLOCKS(200);

// capture scan output into array, pass to host
	
	for (DataMask = 0x00000001; DataMask != 0; 	DataMask<<=1)
	{
		TOGGLE_SCAN_CLOCKS(1);

		for (dut = 0; dut < SCANNumbers[0]; dut++)		
		{
			DUT_MUX = SCANNumbers[dut+1]-1;  		/* select implemented return lines in DUT socket order */
			SCANData[dut] = (DUT_INPUT == 1) ? (SCANData[dut] | DataMask) : (SCANData[dut] & ~DataMask);
		}
	}

// 	Ghost Buster
	for (dut = 0; dut < SCANNumbers[0]; dut++)
		SCANData[dut] = (QCHKResult[dut] == Populated) ? SCANData[dut] : Unpopulated;	/* fill unpopulated sockets with blank data */

	EnableDutData(0,(UINT32)SCANData,DatarrySize);	/* log SCAN data capture */

	RESET_LOW;										/* end of SCAN exercise */

