Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
	OUT0_31=0x00000000;								/* all output drivers low prior to exit */
	SetClocksOff();									/* as well as all clocks terminated low */	

}

/*******************************************************************************/
/*******************************************************************************/
void TOGGLE_EDT_CLOCK(UINT32 numClocks)
{
	int i;
	
	WaitMicroSeconds(5);							/* Delay before continuing */

	for (i = 0; i < numClocks; i++)
	{
		EDT_CLK_HIGH;
		WaitMicroSeconds(5);						/* Delay before continuing */

		EDT_CLK_LOW;
		WaitMicroSeconds(5);						/* Delay, removed to get closer to 50% duty cycle */
	}	
}													/* End of TOGGLE_EDT_CLOCK */

/*******************************************************************************/
/*******************************************************************************/
void TOGGLE_SCAN_CLOCKS(UINT32 numClocks)
{
	int i;
	
	WaitMicroSeconds(5);							/* Delay before continuing */

	for (i = 0; i < numClocks; i++)
	{
		SCAN_CLK_HIGH;
		WaitMicroSeconds(5);						/* Delay before continuing */

		SCAN_CLK_LOW;
		WaitMicroSeconds(5);						/* Delay, removed to get closer to 50% duty cycle */

		EDT_CLK_HIGH;
		WaitMicroSeconds(5);						/* Delay before continuing */

		EDT_CLK_LOW;
		WaitMicroSeconds(5);						/* Delay, removed to get closer to 50% duty cycle */
	}	
}													/* End of TOGGLE_SCAN_CLOCKS */

/*******************************************************************************/
/*******************************************************************************
FUNCTION        : SCAN_HSVG_INIT
PURPOSE         : Loads the HSVG SCAN stimulus to SDRAM
INPUTS NOTES    : void
RETURNS NOTES   : void
GENERAL NOTES   : 
*******************************************************************************/
void SCAN_HSVG_INIT(struct HSVGModule *module)
{
//	UINT16 status;
	UINT32 *data_ptr;

// High Speed Comparator setup - function is currently not used

	SA_REGS.B.HSC_RST = 1;							/* Reset the HSC results */
	SA_REGS.B.HSC_RST = 0;							/* Enable the HSC */
	SA_HSC_DISABLE;									/* Turn off the HSC and SA enables */

// HSVG Init - must be initialized by executing a dummy burst before use (due to a CC-3 bug)

	SetClock(VG_CLK,PLL1,module->Clock1Frequency,50); /* pass frequency from header, 50% duty cycle */
	SetClockOptions(VG_CLK,1,DLY0,INV_OFF,OE_ON );

	data_ptr = (UINT32 *)0xFFC00000;
	*data_ptr = 0x00000000;	
	data_ptr = (UINT32 *)0xFFC00004;
	*data_ptr = 0x00000000;	
	data_ptr = (UINT32 *)0xFFC00008;
	*data_ptr = 0x80000000;							/* note MSB (wrap bit) sets termination vector */
	
	RunHsvg (0xFFC00000, 1, ONE_TIME); 				/* 1s timeout */

// HSVG Init Done - now initialize pattern data for SCAN stimulus

// The data for the multiphase clocks is written into the vector generator buffer at the desired location

	data_ptr = (UINT32 *)module->ExecuteAddress;

// STD Stimulus uses HSVG. Driver assignment vector designation
//
// MSB                .0011122
//                    .2604826
//                    ////////
//                    .0011122
//                    .3715937
//                    ////////
//                    00011222
//                    04826048
//                    ////////
//                    00011222
// LSB                15937159

	*(data_ptr++) = 0x02003000;						/* SCAN clock pulse on EXTAL uses OP.4 */
	*(data_ptr++) = 0x00003000;						/* SCAN SE 16/17 */
	*(data_ptr++) = 0x0C003000;						/* EDT_CLK clock pulse on XTAL uses OP.2/3 */
	*(data_ptr++) = 0x00003000;	
	*(data_ptr++) = 0x02003000;	
	*(data_ptr++) = 0x00003000;	
	*(data_ptr++) = 0x0C003000;	
	*(data_ptr++) = 0x80003000;						/* initial termination will be updated in main flow */

	*(data_ptr++) = 0x40802710;						/* clock DUT 20,000 cycles then capture. repeat. */

	*(data_ptr++) = 0x02003000;	
	*(data_ptr++) = 0x00003000;	
	*(data_ptr++) = 0x0C003000;	
	*(data_ptr++) = 0x00003000;	
	*(data_ptr++) = 0x02003000;	
	*(data_ptr++) = 0x00003000;	
	*(data_ptr++) = 0x0C003000;	
	*(data_ptr++) = 0x00003000;

	*(data_ptr++) = 0x00000000;	
	*(data_ptr++) = 0x02000000;						/* SE low to execute Capture, uses OP.16/17 */
	*(data_ptr++) = 0x00000000;	
	*(data_ptr++) = 0x80003000;						/* SE high to execute Shift, uses OP.16/17 */


// HSVG SCAN Init Done: module.ExecuteAddress

}

/*******************************************************************************
FUNCTION        : SWDRAMBIST - Invoke BI RAM BIST and apply stimulus
PURPOSE         : Execute stress in DFT mode using HSVG for Invoke and stimulus
INPUTS NOTES    : Structure passes in VDUT, VGCLK frequency, PCLK frequency.
                : Invoke vectors are always mapped to memory buffer at 0xFFC0_0000
                : 
                : Structure passes in duration for exercise. Redundancy is ignored.                  
RETURNS NOTES   : void
GENERAL NOTES   : 
*******************************************************************************/

void SWD_RAMBIST(struct HSVGModule *module, UINT32 *BISTData, UINT32 *BISTMode)
{
	UINT32 EnterTime, DisplayTime, TimeToRun;
	int i = 0;										/* index into s-record string array */
	UINT8 status;

	UINT32 ReadResult[SOCKET_COUNT];				/*  */

	DisableDutData(5);								/* avoid data capture during array manipulation. host syns DutData0 */

	EnterTime = ReadSeconds();						/* deduct ramp, RAM Load and message scroll from execution time */

	VddRamp(module->downloadVoltage);				/* ramp down to POR, then up; clocks, all I/P low */

	SetClock(DUT_CLK1,PLL1,module->Clock1Frequency,0); /* EXTAL provides clock for BIST Mode */	
	SetClock(DUT_CLK2,CK1FB,0,0);					/* EXTAL for DUT Bank 2  */	

	SWDResetToIdle();								/* reset JTAG port, select Run-Test/Idle state */		
	SWDReadReg(DPACC,DP_IDR, ReadResult);			/* required operation following reset */
	SWDWriteReg(DPACC,DP_CTRLSTAT,0x50000000);		/* sets CSYSPWRUPREQ, CDBGPWRUPREQ */
	SWDReadReg(DPACC,DP_CTRLSTAT, ReadResult);		/* check status from previous write, capture results */
	SWDWriteReg(DPACC,DP_ABORT,0x0000001F);			/* STICKYERR and others on SWD - clear sticky bit with write 1 to bit  */
	SWDWriteReg(DPACC,DP_SELECT,MDMAP_SEL);			/* Select the MDM-AP to perform system/debug reset, enable CPU hold */

	if(module->TestModeFlag == 1)					/* If flag set, select functional test mode with voltage override */
	{
		Toggle_SWD_CLK(50);							/* wait while voltage stabilizes before applying to bus */
		SWDWriteReg(APACC,MDM_TR,BIBIST_DAC);		
		Toggle_SWD_CLK(50);							/* wait while voltage stabilizes before applying to bus */
		SWDWriteReg(APACC,MDM_TR,BIBIST_PMC);		
	}
	else
	{
		SWDWriteReg(APACC,MDM_TR,BIBIST);		
	}
	Toggle_SWD_CLK(50);								/* propagate final mode selection through logic */
	
	SWDReadReg(APACC,MDM_TR,BISTMode);				/* check status from previous write, capture results */
	SWDReadReg(APACC,MDM_TR,BISTMode);				/* data is posted on first read, captured on second  */

	EnableDutData(5,(UINT32)BISTMode,DatarrySize); 	/* pass mode confirmation to log file */
	EnableDutData(9,(UINT32)BISTData,DatarrySize); 	/* implemented as dummy data, not used, not logged (provided for CTI solution) */

	voltage[0]=module->runVoltage[0];
	voltage[1]=module->runVoltage[1];
	voltage[2]=module->runVoltage[2];
	voltage[3]=module->runVoltage[3];

	status = SetVdutsAll((UINT16)voltage[0],(UINT16)voltage[1],(UINT16)voltage[2],(UINT16)voltage[3]);	
	if ((status != PASS)&&(status != VDUT_WARNING))
	{
		VdutsOff ();	
		DisplayToggle ("VDT1", "Fail");
	}

	WaitMicroSeconds(100000);						/* Delay */

#ifdef DCDC_BUCK

// Buck uses VDUT1 for DCDC_in, VDUT2 for VIO/VIOZ terminations, VDUT4 for GPIO.
// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf2((UINT16)voltage[3],DUTCODE);		/* Driver tracks with VDUT4 */
		SetPsBuf3((UINT16)voltage[3],DUTCODE);		/* Clocks tracks with VDUT4 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT4;						/*  VIO follows VDUT4 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT2;						/* VCLK follows VDUT2 - if powered-off, redeclare to restore voltage */
	}

#else
 #ifdef DCDC_BYPASS

// For CC3/E compatibility, don't declare buffer output levels until power supplies in normal operating range

	if(DRIVER_TYPE == CC3E)
	{
		SetPsBuf1(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf2(voltage[0],DUTCODE);		/* Driver tracks with VDUT1 */
		SetPsBuf3(voltage[0],DUTCODE);		/* Clocks tracks with VDUT1 */
	}
	else if(DRIVER_TYPE == CC3)
	{
		SET_VIO_VDUT1;						/*  VIO follows VDUT1 - if powered-off, redeclare to restore voltage */
		SET_VCLK_VDUT1;						/* VCLK follows VDUT1 - if powered-off, redeclare to restore voltage */
	}

 #else
  #error "Select only one DCDC Converter Mode DCDC_BUCK or DCDC_BYPASS in procedure parameter s19data.h file"
 #endif
#endif

	RESET_HIGH;										/* enter BIST Mode on rising edge */

	BIST_INVOKE_HIGH;								/* begin execution */
	BIST_RESUME_HIGH;								/* continue following DR delay, loop continuously */

