Harry-Yao-ai/QIYUN_BI_driver/kw35a.c
	DisplayScroll(FAST,module->s19FileName);		/* message on LED display */
	DisplayTime = (ReadSeconds()) - EnterTime;		/* adjust execution time to avoid drift in duration */

//	WaitSeconds(module->seconds - DisplayTime);

	TimeToRun = module->seconds - DisplayTime;			
	PolledDelay(TimeToRun);							/* fragment delay to check for Bin2 request */

	RESET_LOW;										/* after stress, assert reset */

	OUT0_31=0x00000000;								/* all output drivers low prior to exit */
	SetClocksOff();									/* as well as all clocks terminated low */
}

/**********************************************************************************/
/**********************************************************************************/
short sqrt(short num) 
{
	short op = num;					/* operand, the number whose square root is being calculated         */
	short res = 0;					/* cumulative results storage, pieced together a bit at a time       */
	short one = 1 << 14; 			/* the second-to-top bit is set: 1L<<30 for long                     */
       								/* "one" starts at the highest power of four <= the argument.        */
	while (one > op)			
		one >>= 2;					/* shift(divide) by 2^2 until results is a number less than 'op'     */
 
	while (one != 0)
	{								/* user 'one' as test value for successive [2^2]^n places            */
		if (op >= res + one)
		{							/* if sum of remaining lower bits + test bit does not overflow       */
			op -= (res + one);		/*  at a [2^2]^n boundary, remove result bit from op(2^(n-1), add    */
			res = (res >> 1) + one;	/*  op(2^n). Then divide cumulative result by 2; add new MSB.        */
		}
		else
			res >>= 1;				/* shift existing bits set by test bit to divide by 2 (sqrt(4))      */

		one >>= 2;					/* and always shift test value to right 2^2 after each MSB bit found */
	}
	return res;						/* pass result to calling argument                                   */
}

/**********************************************************************************/
/**********************************************************************************/


